import 'dart:collection';
import 'dart:math';

import 'package:flutter/material.dart';
import 'package:shared_preferences/shared_preferences.dart';

import 'package:shiny/models/recipe.dart';

class DataModel extends ChangeNotifier {
  final List<Recipe> _recipies = [
    Recipe(
      id: 'm1',
      category: 'Teeth',
      title: 'الفحم',
      subtitle: "تبيض الاسنان",
      steps:
          "من فوائد الفحم إزالة السموم، امزجي الفحم مع كمية صغيرة من الماء، وطبّقيها بلطف  على سطح الأسنان، وتركها لمدة دقيقتين ثم تغسل بالماء جيدا لتخلص من بقايا الفحم",
    ),
    Recipe(
      id: 'm2',
      category: 'Teeth',
      title: 'الفراولة',
      subtitle: "تبيض الاسنان",
      steps:
          "الفراولة يمكن أن تساعد في تبييض الأسنان بسبب احتوائها على انزيم يسمى حمض الماليك وهو يساعد في تذويب القهوة وبقع الشاي على الأسنان وتساعد أيضا على إزالة البقع السطحية و البلاك بسبب احتوائها على الفيتامين س. إهرسي القليل من الفراولة وطبّقيها على اسنانك بستخدام الفرشاة مرة أو مرتين في الأسبوع سيكون لها نتائج إيجابية",
    ),
    Recipe(
      id: 'm3',
      category: 'Teeth',
      title: 'الكركم',
      subtitle: "تبيض الاسنان",
      steps:
          "اخلطي ملعقة من  مسحوق الكركم وملعقه من زيت جوز الهند مع القليل صودا الخبز، وامزجيهم  معا لتشكيل عجينة، واحتفظي بها في مكان بارد، ثم طبّقيها على اسنانك بستخدام فرشاة الأسنان واتركيها  لمدة دقيقتين، ثم تشطف بالماء جيدا",
    ),
    Recipe(
      id: 'm4',
      category: 'Teeth',
      title: 'الموز',
      subtitle: "تبيض الاسنان",
      steps:
          "يمكنك استخدام  قشر الموز لتبيض اسنانك فهي غنية بالبوتاسيوم والمغنيسيوم والمنغنيز والمعادن الأخرى مما يساعد على امتصاص المعادن الغنية إلى ميناء الأسنان. إستعملي قشرة موزه ناضجة و افركيها على أسنانك لمدة دقيقتين، ثم كريريها مرة أخرى قبل النوم",
    ),
    Recipe(
      id: 'm5',
      category: 'Teeth',
      title: 'زيت جوز الهند وأوراق النعناع',
      subtitle: "تبيض الاسنان",
      steps:
          "زيت جوز الهند يحتوي  على حمض اللوري وهو مفيد لصحة الفم وإزالة  البكتيريا، والنعناع يضيف مزايا مضادة للميكروبات ولثة صحية. ببساطة اخلطي زيت جوز الهند مع كمية صغيرة من النعناع المهروس. سيساعد تطبيق هذا المزيج على إزالة بعض البكتيريا السطحية التي هي سبب في إصفرار الأسنان، ومع مرور الوقت ستلاحظين التغيير",
    ),
    Recipe(
      id: 'm6',
      category: 'Teeth',
      title: 'صودا الخبز والليمون',
      subtitle: "تبيض الاسنان",
      steps:
          "قد تكون هذه واحدة من أكثر العلاجات المنزليه شعبية، التفاعل الكيميائي من صودا الخبز مع الحمضيات من عصير الليمون له تأثير في إبتسامه مشرقه ومزجها معا ستكون فائقة الفاعلية. امزجي القليل من صودا الخبز والليمون وطبّقيها على اسنانك بستخدام الفرشاة. كرّري العملية مرة واحدة في الأسبوع، في حالة حدوث تهيج توقفي عن استخدامها",
    ),
    Recipe(
      id: 'm7',
      category: 'Teeth',
      title: 'قشر البرتقال',
      subtitle: "تبيض الاسنان",
      steps:
          "نظيفي  أسنانك مع قشر البرتقال الطازج  بانتظام  يقلل من الصفار المتراكم على أسنانك. افركي قشر البرتقال على أسنانك كل ليلة قبل الذهاب إلى النوم استخدميها لبضعة أسابيع وستلاحظين  نتائج فعالة",
    ),
    Recipe(
      id: 'm8',
      category: 'Hands',
      title: 'لبطاطس',
      subtitle: "تفتيح اليدين",
      steps:
          "أحد عوامل التبيض الجيدة و هي مفيدة أيضًا للتخلص من الهالات السوداء ، و تساهم عصارة البطاطس في توحيد لون الجلد. احضري حبّة بطاطس مسلوقة تهرس جيدا ويضاف إليها معلقة من العسل و يترك علي الجلد لمدة 20 دقيقة، ثم يشطف جيدًا",
    ),
    Recipe(
      id: 'm9',
      category: 'Hands',
      title: 'لطماطم',
      subtitle: "تفتيح اليدين",
      steps:
          "من الخضروات المليئة بفيتامين سي، وتعمل بشكل فعال على تبيض البشرة ، فقط احضري حبّة طماطم كبيرة مع بعض قطرات من عصير الليمون و القليل من ماء الورد و اخلطيهم جيدا ثم قومي بمسح يديكِ و الوجه و الرقبة باستخدام فرشاة ناعمة و اتركيهم لمدة 15 دقيقة و يمكن استخدامه يوميا للحصول علي أفضل النتائج. الطماطم بمفردها أيضًا تعمل على إكساب شفتيكِ اللون الوردي بتمرير شريحة على الشفاه يوميًا",
    ),
    Recipe(
      id: 'm10',
      category: 'Hands',
      title: 'القهوة',
      subtitle: "تفتيح اليدين",
      steps:
          "يمكنكِ خلط معلقة من القهوة (البن المطحون) مع معلقة كبيرة من العسل لمدة 15 دقيقة ثم تغسل اليدين جيدا.. يمكنكِ استخدام نفس الخليط كمقشر لعلامات تمدد الجلد و بقع البشرة الداكنة",
    ),
    Recipe(
      id: 'm11',
      category: 'Hands',
      title: 'اللوز ',
      subtitle: "تفتيح اليدين",
      steps:
          "يساهم في الحد من اسمرار البشرة، ويدخل في مكونّات العديد من مستحضرات التجميل المخصصة لتفتيح البشرة ، فقط اخلطي قليل من الشوفان المطحون مع اللوز المطحون و ملعقة لبن حتي تحصلي علي خليط متجانس و ضعيه علي يديكِ قبل النوم لمدة 10 دقائق و اشطفية بماء فاتر، كرري العملية كل أسبوعين",
    ),
    Recipe(
      id: 'm12',
      category: 'Hands',
      title: 'الليمون',
      subtitle: "تفتيح اليدين",
      steps:
          "يمكنكِ استخدام الليمون لتحصلي علي بشرة بيضاء، وهو يعد واحدًا من عوامل التبيض الطبيعية ، فحمض الستريك الموجود في الليمون يساهم في التخلص من كافة البقع الغامقة المتراكمة علي الجلد و المسام، ويزيل الزيوت و اﻷوساخ المتراكمة، ويمكن استخدامه من خلال خلط معلقة من عصيرالليمون مع معلقة من ماء الورد و باستخدام القطنة قومي بالمسح علي المنطقة التي تريدين تبيضها سواء اليد أو الوجه بشكل دوري يوميًا.تجنبي الليمون على بشرة وجهكِ إذا كنتِ تعانين من الحساسية",
    ),
    Recipe(
      id: 'm13',
      category: 'Body',
      title: 'بيكربونات الصوديوم',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "لابد من عمل عجين سميكة من هذا الخليط ووضعها على الأماكن الحساسة الغامقة وتركها حتى تجف تماماً ثم تفرك بلطف .. وتترك البشرة حتى تجف أيضاً بعد الفرك",
    ),
    Recipe(
      id: 'm14',
      category: 'Body',
      title: 'البرسيم الأحمر',
      subtitle: "تكبير الصدر",
      steps:
          "إضافة واحد أو اثنين ملعقه صغيرة من زهور البرسيم الأحمر المجففه  لكوب واحد من الماء الساخن اتركيه يغلي لمدة 30 دقيقة . يترك ليبرد ويشرب هذا الشاي مرتين أو ثلاث مرات في اليوم. تكرار هذا العلاج لمدة بضعة أشهر للحصول على النتيجة المرجوة",
    ),
    Recipe(
      id: 'm15',
      category: 'Body',
      title: 'البطاطا البريه',
      subtitle: "تكبير الصدر",
      steps:
          "يمكن أن تؤخذ البطاطا الحلوة البرية في شكل الشاي أو كبسولة لتكبير الثدي. يمكنك أيضا تدليك ثدييك مع كريم البطاطا البريه للسماح للالبروجسترون على استيعابه من خلال الجلد. القيام بذلك مرتين يوميا لعدة أشهر لاحظت زيادة حجم الثدي",
    ),
    Recipe(
      id: 'm16',
      category: 'Body',
      title: 'البطاطس',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "نأخذ شرائح رقيقة من البطاطس ويمكن فرك الأبطين والأماكن الحساسة لمدة 10 دقائق ثم تغسل الأماكن بماء فاتر",
    ),
    Recipe(
      id: 'm17',
      category: 'Body',
      title: 'البوريريا',
      subtitle: "تكبير الصدر",
      steps:
          "يمكنك العثور على البوريريا في السوق كنوع من الكريمات الموضعية والمواد الهلامية اوالصابون أو في كبسولة وقرص تؤخذ عن طريق الفم. الجرعة عن طريق الفم الموصى بها هي 250 ملغ مرتين يوميا. وبالنسبة للمنتجات الموضعية توزيعه على منطقة الثدي مرتين يوميا لمدة ثلاث لـ خمس دقائق حتى يستوعبه تماما. وينبغي أن تتبع هذه العلاجات لمدة ثلاثة أشهر لتحقيق النتيجة المرجوة",
    ),
    Recipe(
      id: 'm18',
      category: 'Body',
      title: 'التمر السكري',
      subtitle: "تكبير الأرداف",
      steps:
          "تُحضر عن طريق مزج التمر السكري منزوع النوى في نصف كوب من الماء الدافئ، ثم يوضع المزيج على النار حتى يصبح دافئاً، وبعدها تضاف ملعقة كبيرة من السمن أو الزبدة وكوب من الحليب الدافئ وملعقة صغيرة من الحلبة المطحونة، وتمزج المكونات جيداً ثم يتم تناولها يومياً صباحاً ومساءً إلى حين التوصل إلى النتائج المطلوبة",
    ),
    Recipe(
      id: 'm19',
      category: 'Body',
      title: 'الجوز والبطاطا',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "لايمكن أن نغفل عن البطاطا وفوائدها الكثيرة ومن بينها توحيد لون البشرة، حيث تستخدم البطاطا بفركها على الرّقبة وتركها لمدّة خمس دقائق، وكذلك عصير البطاطا مع عصير الّليمون يستخدم لمدّة عشرين دقيقةً ثمّ تغسل الرّقبة بالماء، ويمكن خلط الجوز بعد طحنه مع العسل ويوضع على الرّقبة مدّة نصف ساعة",
    ),
    Recipe(
      id: 'm20',
      category: 'Body',
      title: 'الحلبة والخميرة',
      subtitle: "تكبير الأرداف",
      steps:
          "تكون بمزج ملعقة كبيرة من الحلبة المطحونة مع ملعقة صغيرة من خميرة البيرة، ثم إضافة القليل من الماء الفاتر حتى تتكون عجينة لينة، فتُدهن الأرداف بشكل دائري قبل الذهاب إلى النوم وتترك طوال الليل، ثم يتم غسلها في الصباح بالماء الفاتر، وبعدها تُكرر الوصفة يومياً إلى حين الوصول إلى الحجم المطلوب",
    ),
    Recipe(
      id: 'm21',
      category: 'Body',
      title: 'الخميرة أو صودا الخبز',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "تعمل الخميرة كمقشّر طبيعيّ للخلايا الميّتة وإزالة السّواد حيث تخلط كميّة من الخميرة بكميّة من الماء وتُوضع على الرّقبة، وبعد أن تجفّ مدّة عشر دقائق تُغسل الرّقبة بالماء، وتُكرّر هذه الخلطة مع باقي الخلطات للحصول على أفضل النّتائج",
    ),
    Recipe(
      id: 'm22',
      category: 'Body',
      title: 'الخيار',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "نحضر عدد من حبات الخيار ونعصرها ونضيف إليها عصير الليمون المناسب للكمية عصير الخيار ونضيف إليهما القليل من الكركم  .الليمون يبيض البشرة ويزيل الجلد الميت . الخيار يساعد على التبييض أيضاً ويزيل آثار لون الكركم . وهذا الخليط علاج قوى جداً بدون أى آثار جانبية وللإستخدام اليومى",
    ),
    Recipe(
      id: 'm23',
      category: 'Body',
      title: 'الزبادى',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "تتكون هذه الخلطة من : علبة زبادى – 2 ملعقة دقيق – 2 ملعقة حليب – ملعقة عسل نحل – ملعقة زيت جنين القمح , قومى بتقليب هذه المكونات جيدا و ضعيها على المناطق التى تريدين تبييضها",
    ),
    Recipe(
      id: 'm24',
      category: 'Body',
      title: 'الزعفران الأصفر',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "نحضر بعض الحليب مع بعض خيوط الزعفران .نخلط الزعفران مع الحليب وربما نتركه بعض الوقت حتى يذوب مع الحليب بالقدر المطلوب .نستخدم هذا الخليط على الأماكن كلها ومن الأفضل أن نستخدمها ليلاً حتى الصباح لنستفيد قدر الإمكان من هذا الوقت بإعطاء النتائج الهائلة . كما نستفيد من فوائد الحليب وخصائص الزعفرانأطول فترة ممكنة  ثم يغسل فى الصباح",
    ),
    Recipe(
      id: 'm25',
      category: 'Body',
      title: 'القهوة',
      subtitle: "التخلص من الأرداف",
      steps:
          "نخلط كوب من الماء الدافيء، وأربع ملاعق من القهوة، ودلّكي بها الأرداف بشكل دائري لمدة عشرة دقائق",
    ),
    Recipe(
      id: 'm26',
      category: 'Body',
      title: 'الكوسا',
      subtitle: "التخلص من الأرداف",
      steps:
          "نسلق حبة من الكوسا، وحبة من الفاصولياء الخضرا، ونضعهم في الخلاط الكهربائي لمدّة عشر دقائق حتّى نحصل على خليط متماسك، ونتناول هذا الخليط ثلاث مرات يومياً بعد كل وجبة طعام",
    ),
    Recipe(
      id: 'm27',
      category: 'Body',
      title: 'الليمون',
      subtitle: "تبييض المناطق الحساسة",
      steps:
          "كما تعلمين أن الليمون حمض قوى و له أثر فعال جدا فى تبييض البشرة لذلك يستخدم الليمون فى تبييض المناطق الحساسة , فقط قومى بدعك هذه المناطق بالليمون ثم ضعى نشا بودرة عليها لمدة نصف ساعة ثم افركى النشا و ادهنى عسل نحل على هذه المناطق و اتركيه لنصف ساعة ثم اشطفى هذه الاماكن , لتحصلى على نتائج ممتازة من هذه الخلطة عليكِ المداومة عليها يوميا لمدة ثلاث شهور و لكنكِ ستلاحظين الفرق بعد شهر واحد ان شاء الله",
    ),
    Recipe(
      id: 'm28',
      category: 'Body',
      title: 'النخيل لتكبير',
      subtitle: "تكبير الصدر",
      steps:
          "يمكنك شرب 2-3 أكواب من الشاي النخيل يوميا لمدة بضعة أشهر. إذا أخذتها كمكملات غذائية تبدأ ب 160 ملغ تحتوي على 85 إلى 95 بالمائة سيترول ودهون تؤخذ مرتين يوميا. ولجرعة مناسبة يجب استشارة الطبيب",
    ),
    Recipe(
      id: 'm29',
      category: 'Body',
      title: 'الّلبن والخيار',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "تفيد هذه المواد الجلد إذ تزيد نضارته بإزالة الخلايا الميّتة وإعادة حيويّة البشرة، ويوضع الّلبن على الرّقبة مدّة عشرين دقيقةً، كذلك يوضع الخيار أو عصيره على الرّقبة لمدّة خمس عشرة دقيقةً، ثمّ يغسل بالماء البارد ويمكن وضع ماء الورد لتلطيف البشرة",
    ),
    Recipe(
      id: 'm30',
      category: 'Body',
      title: 'بذور الشمر',
      subtitle: "تكبير الصدر",
      steps:
          "تسخن ملعقة كبيرة من زيت كبد سمك القد مع ملعقتين من بذور الشمر في وعاء . السماح للبذور لتتحول للون الاحمر. يترك الزيت ليبرد. استخدم هذا الزيت لتدليك ثدييك برفق لمدة خمس إلى 10 دقائق. وتركه على الصدر لمدة 30 دقيقه ثم غسله بالماء الدافئ. اتباع هذا العلاج مرتين يوميا لمدة شهر أو شهرين. يمكنك أيضا شرب كوب من شاي الشمر يوميا . لعمل شاي الشمر إغلي ملعقة من بذور الشمر في كوب من الماء الساخن لمدة 10 دقائق ثم قومى بتصفيته",
    ),
    Recipe(
      id: 'm31',
      category: 'Body',
      title: 'بذور الكتان',
      subtitle: "التخلص من الأرداف",
      steps:
          "نضع ملعقة من بذور الكتان غير المطحونة، وكوب من الماء، في إناء للطهي، ونضعه على النار لمدة ربع ساعة، ثمّ نتركه ليبرد تماماً، ونشرب منه ثلاث مرات في اليوم، قبل كل وجبة من الطعام",
    ),
    Recipe(
      id: 'm32',
      category: 'Body',
      title: 'بودرة الكركم',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "ينظّف الكركم البشرة ويزيد نعومتها ويزيل الخلايا الميّتة، وطريقة الاستخدام تكون بخلط بودرة الكركم مع القليل من الماء أو عصير الّليمون، وتفرك الرّقبة جيّداً بالخليط لمدّة خمس دقائق، وبعد خمس عشرة إلى عشرين دقيقةً تغسل الرّقبة جيّداً",
    ),
    Recipe(
      id: 'm33',
      category: 'Body',
      title: 'الحلبه',
      subtitle: "تكبير الصدر",
      steps:
          "خلط ربع كوب من مسحوق الحلبة مع قليل من الماء لجعل عجينة. توزع العجينة على الثدي وتدليك بلطف . السماح لها بالجلوس لمدة 10 دقائق ثم يشطف بالمياه. اتبع هذا العلاج مرتين يوميا لأفضل النتائج .خيار آخر هو تدليك صدرك يوميا  مع زيت الحلبة أو خليط من مستخلص الحلبة مع مرطب للجسم .يمكنك أيضا ادخال براعم الحلبة لنظامك الغذائي أو اتخاذ الحلبة في شكل حبوب ثلاث مرات يوميا بعد استشارة الطبيب",
    ),
    Recipe(
      id: 'm34',
      category: 'Body',
      title: 'جذور الهندباء',
      subtitle: "تكبير الصدر",
      steps:
          "يمكنك شرب شاي جذور الهندباء مرتين يوميا أو اتخاذ كبسولات جذور الهندباء (525 ملغ) مرة واحدة يوميا . وهذه العلاجات تعطيك النتائج المرجوة في غضون بضعة أشهر",
    ),
    Recipe(
      id: 'm35',
      category: 'Body',
      title: 'حلاوة الطحينية والمكسرات',
      subtitle: "تكبير الأرداف",
      steps:
          "تكون بمزج علبة صغيرة من حلاوة الطحينية بالمكسرات مع كوب ونصف من مخلوط الكاجو واللوز والجوز والفستق الحلبي، ثم يوضع المزيج بالخلاط الكهربائي، وتضاف له ملعقة ونصف من الخميرة الفورية، وبعدها يتم تناول المزيج يومياً مع كوب من اللبن أو الحليب قبل الخلود إلى النوم",
    ),
    Recipe(
      id: 'm36',
      category: 'Body',
      title: 'زيت الزيتون',
      subtitle: "التخلص من الأرداف",
      steps:
          "نضع كوباً من زيت الزيتون النقي، وأربع حبات من الزنجبيل الطازج المبشور، في وعاء مناسب، ونضعه على نار عالية حتي يغلي تماما، ثم نقوم بالتخفيف من النار، ونتركه يغلي لمدة عشر دقائق، نترك هذا المزيج جانباً حتر يبرد تماماً، ونقوم بدهن منطقة الأرداف، وبعدها المشي لمدّة نصف ساعة كاملة",
    ),
    Recipe(
      id: 'm37',
      category: 'Body',
      title: 'زيت جنبن القمح والخميرة',
      subtitle: "تكبير الأرداف",
      steps:
          "تكون بخلط ملعقتين صغيرتين من الحلبة في كوب من الماء، ثم وضع المزيج على النار حتى يغلي، ثم رفعه عن النار ووضعه جانباً حتى يبرد قليلاً فقط ويصبح فاتراً، ثم إضافة ملعقة صغيرة من الخميرة وملعقتين صغيرتين من زيت جنين القمح، وتحريكه جيداً حتى تمتزج المكونات معاً. بعدها يتم عمل كمادات ماء دافئ على الأرداف أولاً لتنشيط الدورة الدموية في الأنسجة الدهنية، ثم تُغمس قطعة كبيرة من القطن أو منشفة في مزيج الحلبة وتوضع على الأرداف، وعند جفافها تُغمس مرة أخرى وتوضع مع مراعاة عمل مساج دائري لمدة ربع ساعة، وبعدها يُترك المزيج على الأرداف لمدة ساعتين على الأقل، ثم يُشطف بالماء البارد، ويفضل تكرار الوصفة يومياً للحصول على نتائج سريعة وفعالة",
    ),
    Recipe(
      id: 'm38',
      category: 'Body',
      title: 'زيت جنين القمح',
      subtitle: "تكبير الصدر",
      steps:
          "تدليك بضع قطرات من زيت جنين القمح على ثدييك في حركات دائرية لمدة 10 دقيقة. اتبع هذا العلاج مرتين أو ثلاث مرات يوميا لرؤية التحسن في غضون شهر",
    ),
    Recipe(
      id: 'm39',
      category: 'Body',
      title: 'عصير الّليمون',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "ينصح باستخدام الّليمون لتفتيح البشرة، تدلّك به الرّقبة ويترك لمدّة عشرين دقيقةً، ثمّ تغسل الرّقبة، وتفرك يومياً للحصول على أفضل النتائج",
    ),
    Recipe(
      id: 'm40',
      category: 'Body',
      title: 'هلام الصّبّار وزيت الزّيتون',
      subtitle: "إزالة سواد الرّقبة",
      steps:
          "تتمتّع المواد الطّبيعيّة بخصائص مدهشة للتّخلّص من معظم مشاكل البشرة، ومن أهمّ هذه المواد زيت الزّيتون المفيد للشّعر وتغذية البشرة وتفتيحها، بلاإضافة إلى التّخلّص من آثار التّقدّم في العمر وتأخير الشّيخوخة، إذ ينصح بوضع زيت الزّيتون مع عصير الّليمون وتدليك الرّقبة به بشكل يوميّ، ويترك لمدّة عشرين دقيقةً ثمّ تغسل الرّقبة بالماء. ويعتبر الصّبّار من المواد المرطّبة للجلد إذ يحافظ على نعومته، وعند الحصول على المادّة الهلاميّة التي تشبه الجلّ من ورق الصّبار تُدلّك بها الرّقبة وتترك لمدّة عشرين دقيقةً ثمّ تغسل الرّقبة، وتستخدم أيضاً بشكل يوميّ للحصول على أفضل النّتائج",
    ),
    Recipe(
        id: 'm41',
        category: 'Lips',
        title: 'الألوة فيرا',
        subtitle: "علاج تشقق الشفاه",
        steps:
            "الألوة فيرا تساعد في تخلص من تشقق الشفتين، كما أنها تساعد على تهدئة الألم، قومي بوضع هلام الألوة فيرا بضع مرات في اليوم وستلاحظي الفراق"),
    Recipe(
      id: 'm42',
      category: 'Lips',
      title: 'الألوة فيرا',
      subtitle: " توريد الشفاه",
      steps:
          "الرمان له نسبة عالية من مادة البوليفينول، الفلافونويد، والمضادة للتأكسد، و يساعد على إعادة اللون الوردي الطبيعي للشفايف. فما عليكِ إلا طحن بذور الرمان ومزجها جيدا ثم تخلط مع ملعقه من ماء الورد والحليب، ثم دلكي الخليط بلطف على شفتيك لمدة ثلاث دقائق قبل الشطف وسترين النتيجه على الفور. طريقه أخرى رائعة امزجي كمية متساوية من عصير الرمان وعصير الشمندر وعصير الجزر وضعيها على  شفتيك مرة واحدة يوميا",
    ),
    Recipe(
      id: 'm43',
      category: 'Lips',
      title: 'الزبادي والعسل',
      subtitle: "علاج تشقق الشفاه",
      steps:
          "اخلطي ملعقه صغيره من الزبادي والعسل للحصول على علاج للشفاه المتشققة. تطبيق المزج على شفتيك يوميا وستتخلصين من الشقوق",
    ),
    Recipe(
      id: 'm44',
      category: 'Lips',
      title: 'السكر',
      subtitle: "علاج تشقق الشفاه",
      steps:
          "السكر يساعد على التخلص من تشقق الشفتين، ببساطة خذي ملعقة صغيرة من السكر وزيت الزيتون أو يمكنك استخدام زيت اللوز الحلو و لك إختيار. قومي بفرك المزج على شفتيك بلطف يوميا و ستتخلصين من شقوق الشفاه",
    ),
    Recipe(
      id: 'm45',
      category: 'Lips',
      title: 'العسل',
      subtitle: "إزالة سواد الشفاه",
      steps:
          "اخلطي ملعقة من لبن الزبادي وملعقتين من عسل النحل خلطاً جيداً، ثم ادهني بالمزيج الناتج منطقة الشفاه وحول الفم واتركيه لمدة ربع ساعة، بعد ذلك اشطفي وجهك بالماء البارد، ويُفضل أن تكرري هذه الوصفة بشكل يومي ولمدة أربعة عشر يوماً",
    ),
    Recipe(
      id: 'm46',
      category: 'Lips',
      title: 'العسل',
      subtitle: "علاج تشقق الشفاه",
      steps:
          "العسل هو واحد من العلاجات الأكثر شعبية لعلاج تشقق الشفاه، ضعي العسل على شفتيك قبل الذهب إلى الفراش، واشطفيه في صباح يوم التالي. كرري هذه العمليه يوميا",
    ),
    Recipe(
      id: 'm47',
      category: 'Lips',
      title: 'العسل',
      subtitle: "تكبير الشفاه",
      steps:
          "العسل هو أيضا مرطب جلد ممتاز، ببساطه قومي بتطبيق العسل على شفتيكي لمدة 20 دقيقة يوميا، وستحصلين على نتيجة رائعه خلل فتره وجيزه",
    ),
    Recipe(
      id: 'm48',
      category: 'Lips',
      title: 'الفازلين والقرفة',
      subtitle: "تكبير الشفاه",
      steps:
          "اخلطي الفازلين مع القرفة، واتركي المزيج يرتاح لمدة خمس دقائق، ثم ضعي الخلطه على شفتيكي، كرّري هذه العمليه بنتظام وستحصلين على نتيجة فعالة",
    ),
    Recipe(
      id: 'm49',
      category: 'Lips',
      title: 'الكركم و الحليب',
      subtitle: "توريد الشفاه",
      steps:
          'الكركم  فعال في تفتيح الأماكن الغامقه .اخلطي ملعقه من الحليب البارد مع القليل من مسحوق الكركم لتشكيل عجينة سميكة، أولا افركي شفتيك برفق باستخدام فرشاة أسنان  ناعمة ( فرشاة الأسنان الناعمة تعمل كمقشر جيد للغاية لشفتيك) ثم طبيقي القليل من معجون الكركم على شفتيك واتركيه لمدة لا تزيد عن ثلاث دقائق ثم اشطفيها بالماء الدافئ، وأخيرا إستعملي مرطب الشفاه من اختيارك.',
    ),
    Recipe(
      id: 'm50',
      category: 'Lips',
      title: 'اللوز',
      subtitle: "توريد الشفاه",
      steps:
          " E، B، B2، B6، والأحماض الدهنية والمواد المضادة للتأكسد. امزجي جيدا ملعقه من اللوز المطحون مع ملعقه من الحليب، ثم طبقيها على الشفايف ودلكيها بلطف لمدة ثلاث دقائق ثم اشطفيها بالماء. استخدمي الطريقة يوميا. طريقه أخرى امزجي خمس أو ست قطرات من زيت اللوز مع ملعقة من العسل في وعاء، وطبّقيها على شفتيك لمدة أربع دقائق قبل الشطف. كررها يوميا حتى تظهر النتيجه-",
    ),
    Recipe(
      id: 'm51',
      category: 'Lips',
      title: 'لليمون',
      subtitle: "توريد الشفاه",
      steps:
          "الليمون له خاصية التبييض الطبيعية التي تعمل كوكيل لتفتيح البشرة. يحتوي عصير الليمون الطازج على الحمضيات التي تساعد على التفتيح وتوريد الشفايف. طبيقي عصير الليمون على شفتيك قبل الذهاب إلى الفراش و اشطفيه في الصباح، اتبعي هذا العلاج  يوميا لمدة شهر أوشهرين. طريقه أخرى يمكنك تحضير مزيج من نصف ملعقة كل من عصير الليمون والجلسرين والعسل، وطبّقيها على الشفايف قبل الذهاب إلى الفراش. كرّري هذه الوصفه حتى تستمتعين بشفاه مثاليه",
    ),
    Recipe(
      id: 'm52',
      category: 'Lips',
      title: 'الليمون والجليسرين',
      subtitle: "زالة سواد الشفاه",
      steps:
          "اخلطي عصير الليمون وكمية مناسبة من الجليسرين واحفظي المزيج في الثلاجة، ثم طبقي المزيج على شفاهكِ مساء كل يوم وقبل ذهابكِ إلى النوم واتركيه حتى الصباح",
    ),
    Recipe(
      id: 'm53',
      category: 'Lips',
      title: 'النشا',
      subtitle: "إزالة سواد الشفاه",
      steps:
          "أضيفي ملعقة من مسحوق النشا إلى كمية مناسبة من الماء الدافئ واخلطي المزيج جيداً، حتى يصبح قوامه شبيهاً بالكريم، ثم ضعي المزيج جانباً ليبرد ثم طبقيه على شفاهكِ واتركيه ليجف تماماً، ثم أحضري منشفة مبللة بالقليل من الماء البارد، وانزعي بواسطتها المزيج، بعد ذلك افركي شفاهك بقشر الليمون",
    ),
    Recipe(
      id: 'm54',
      category: 'Lips',
      title: 'بلسم الشفاه',
      subtitle: "علاج تشقق الشفاه",
      steps:
          "استخدام بلسم الشفاه كل يوم للحماية من الأضرار التي تتعرض لها شفتيك. قومي بوضع مرهم الشفة الطبيعي خصوصا في فصل الشتاء، لتجنب التشقق وللحصول على شفاه رطبة",
    ),
    Recipe(
      id: 'm55',
      category: 'Lips',
      title: 'زيت الزيتون',
      subtitle: " توريد الشفاه",
      steps:
          "زيت الزيتون يمكن استخدامه للحصول على شفتين ورديتين نابضة بالحياة. فهو يحتوي على العديد من العناصر الغذائية الضرورية لتغذية و ترطيب شفتيك. قومي بتطبيق بضع قطرات من زيت الزيتون الممتاز على شفتيك ودليكه برفق. كرّري الطريقة يوميا قبل الذهاب إلى الفراش",
    ),
    Recipe(
      id: 'm56',
      category: 'Lips',
      title: 'زيت الزيتون',
      subtitle: "علاج تشقق الشفاه",
      steps:
          "زيت الزيتون يحتوي على العديد من الفيتامينات، مما يساعد في التخلص من شقوق الشفاه وتلينها. قومي بفرك  قطرات من زيت الزيتون على شفتيك قبل الذهب إلى الفراش، ويشطف في صباح يوم التالي. تبعي هذا العلاج يوميا وستندهشن بالفراق",
    ),
    Recipe(
      id: 'm57',
      category: 'Lips',
      title: 'النشا',
      subtitle: "إزالة سواد الشفاه",
      steps:
          "ادهني شفاهكِ بكمية قليلة من زيت الزيتون ثم ضعي فوقه القليل من مطحون السكر، ثم اتركي المزيج على شفاهكِ ليجف تماماً بعد ذلك ضعي فوقه العسل واتركيه ليجف، ثم ادهني شفاهكِ بالفازلين، ثم طبقي هذه الوصفة ثلاث مرات أسبوعياً قبل ذهابكِ إلى النوم",
    ),
    Recipe(
      id: 'm58',
      category: 'Lips',
      title: 'زيت اللوز',
      subtitle: "إزالة سواد الشفاه",
      steps:
          "ادهني شفاهك بكمية قليلة من زيت اللوز ودلكيه بحركات دائرية، حيث إن التدليك يساعد على تحسين الدورة الدموية وتقشير الجلد الميت الذي يتسبب باسوداد البشرة",
    ),
    Recipe(
      id: 'm59',
      category: 'Lips',
      title: 'زيت النعناع',
      subtitle: "تكبير الشفاه",
      steps:
          "قومي بخلط زيت النعناع مع الفازلين، واستخدامه يوميا ك بلسم الشفاه، وستحصلين على نتيجة رائعه خلال فتره وجيزه",
    ),
    Recipe(
      id: 'm60',
      category: 'Lips',
      title: 'زيت جوز الهند والكاكاو وزيت اللوز',
      subtitle: "تكبير الشفاه",
      steps:
          "اخلطي  ملعقة كبيرة من زيت جوز الهند مع 1/3 ملعقة كبيرة من زبدة الكاكاو المذابة و 20 قطرات من زيت اللوزالحلو، قومي بتطبيق المزيج يومين، وستحصلين على نتيجة رائعه",
    ),
    Recipe(
      id: 'm61',
      category: 'Lips',
      title: 'سكر والماء',
      subtitle: "تكبير الشفاه",
      steps:
          "اخلطي كمية قليلة من السكر والماء، بعد الحصول على عجينه، قومي بتدلكها على شفتيك، كرّري هذه العمليه مره واحده أسبوعين",
    ),
    Recipe(
      id: 'm62',
      category: 'Lips',
      title: 'عصير الليمون',
      subtitle: "تكبير الشفاه",
      steps:
          "قومي بتدليك عصير الليمون على شفتيكي، لإزالة رقائق الجلد الميت والزيوت والأوساخ منه، واتركيه حتى يجف، ثم اغسليه، فهذا واحد من أفضل العلاجات للحصول على شفاه أكبر بشكل طبيعي",
    ),
    Recipe(
      id: 'm63',
      category: 'Lips',
      title: 'ماء الورد',
      subtitle: "توريد الشفاه",
      steps:
          "ماء الورد لديه خصائص طبية مهدئه ومرطبه ويساعد أيضا في  إضافة اللون الوردي الطبيعي للشفايف الداكنه. امزجي  قطرة واحدة من ماء الورد مع ملعقه من العسل، ودلكيها على شفتيك  لثلاث أو أربع مرات في اليوم. بدلا من ذلك امزجي ملعقة من ماء الورد وملعقة من الزبدة والعسل، طبّقيها على شفتيك وافركيها بلطف، اتبعي هذا العلاج مرتين في الأسبوع. طريقه أخرى رائعة انقعي القليل من الورد  في الحليب  لمدة ساعة واحدة، ثم إطحنيها وأضيفي إليها نصف ملعقة صغيرة من العسل وقليل من الزعفران وضعي الخليط على شفتيك وأتركيها  لمدة 15 دقيقة. طبيقي الخلطة مرتين في اليوم",
    ),
    Recipe(
      id: 'm64',
      title: 'أكياس الشاي',
      category: 'Eyes',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "ببساطة ضعي كيسين من الشاي الأسود أو الأخضر في الثلاجة لمدة 30 - 40 دقيقة، وطبّقيها حول عينيك لمدة 10 - 15 دقيقة ثم اشطفيها بالماء .كرّري العملية مرة أو مرتين في اليوم ستساعد في علاج الهالات السوداء والانتفاخ خلال فترة قصيرة",
    ),
    Recipe(
        id: 'm65',
        category: 'Eyes',
        title: 'أكياس الشاي',
        subtitle: 'انتفاخ العين',
        steps:
            'أحضري كمية قليلة من الماء الساخن ثم انقعي فيها أكياس الشاي، بعد ذلك اتركي الأكياس لتبرد ثم طبقيها على جفونك وغطيها بقطعة ناعمة من القماش، واتركيها لمدة تتراوح ما بين عشر إلى خمس عشرة دقيقة، واستمري في تطبيق هذه الوصفة لعدة مرات يومياً'),
    Recipe(
        id: 'm66',
        category: 'Eyes',
        title: 'أوراق النعناع',
        subtitle: 'الهالات السوداء حول العينين',
        steps:
            'قومي بسحق بعض من أوراق النعناع واضيفي إليها ملعقة كبيرة من عصير الطماطم، طبيقي الخيط حول عينيك واتركيه لمدة 5 دقائق، ثم اشطفيه بالماء البارد. أو يمكنك تطبيق عصير الليمون بدلاً من عصير الطماطم حول العينين لمدة 10 - 15 دقيقة. كرّري العملية يوميا حتى تختفي الهالات السوداء نهائيا'),
    Recipe(
        id: 'm67',
        category: 'Eyes',
        title: 'الأفوكادو',
        subtitle: 'الهالات السوداء حول العينين',
        steps:
            "ببساطة طبيقي بعض من شرائح الأفوكادو حول عينيك لمدة 15-20 دقيقة. طريقة أخرى رائعة، امزجي بضع قطرات من زيت اللوز مع الأفوكادو المهروس وطبّقيها على المنطقة المصابة لمدة 15 - 20 دقيقة. واظبي على استخدام الطريقة بانتظام كي تلاحظي النتائج."),
    Recipe(
        id: 'm68',
        category: 'Eyes',
        title: 'البطاطا',
        subtitle: 'الهالات السوداء حول العينين',
        steps:
            "طبيقي القليل من عصيرالبطاطا البارد حول عينيك باستخدام قطنة واتركيها لمدة 10-15 دقيقة، ثم اشطفيها بالماء البارد. يمكنك أيضا وضع عصيرالبطاطا المتجمد في قطعة قماش وتطبيقها حول العينين لمدة 10 - 15 دقيقة. ستساعد هذه الطريقة بشكل رائع في التخلص من الهالات السوداء"),
    Recipe(
        id: 'm69',
        category: 'Eyes',
        title: 'التدليك',
        subtitle: 'تكثيف الحواجب',
        steps:
            "له أهميّة كبيرة في تنشيط الدّورة الدّموية، يُفضّل أن تُدلّكي حواجبك بلطف يوميّاً ثلاث أو أربع مرّات، والتّدليك يكون إمّا بالتّمشيط بفرشاة الحواجب باتّجاه الشّعر، أو من خلال التّدليك بحركة دائريّة."),
    Recipe(
        id: 'm70',
        category: 'Eyes',
        title: 'التفاح',
        subtitle: 'الهالات السوداء حول العينين',
        steps:
            "يساعد التفاح على تفتيح وتغذية البشرة لاحتوائه على فيتامينات B و Cوالبوتاسيوم والعديد من الخصائص الأخرى. قومي بتقطيع تفاحة ناضجة إلى قطع وضعيها حول عينيك لمدة 30 دقيقة، ثم اشطفيها بالماء البارد. استخدمي الطريقة بانتظام حتى تتخلصي من الهالات السوداء خلال فترة وجيزة "),
    Recipe(
        id: 'm71',
        category: 'Eyes',
        title: 'الثّوم وزيت الزّيتون',
        subtitle: 'تكثيف الحواجب',
        steps:
            'خذي فصّاً من الثّوم وابرشيه مع ملعقة من زيت الزيتون، وادهني الحواجب به من مرّة إلى مرّتين في اليوم مدّة أسبوع'),
    Recipe(
        id: 'm72',
        category: 'Eyes',
        title: 'الحليب',
        subtitle: 'الهالات السوداء حول العينين',
        steps:
            "يحتوي الحليب على العديد من العناصر التي تساعد في ترطيب وتلطيف البشرة مع تقليل الانتفاخ. ببساطة اغمسي كرة من القطن في الحليب البارد وضعيها حول عينيك واتركيها لمدة 5-7 دقائق، استخدمي الطريقة 3-4 مرات يوميا وستلاحظي الفرق"),
    Recipe(
      id: 'm73',
      category: 'Eyes',
      title: 'الحليب',
      subtitle: 'تكثيف الحواجب',
      steps:
          "يساعد الحليب على نموّ الشّعر ناعماً، استخدمي قطنة لفرد الحليب على الحواجب وتركه حتّى يجف، ثمّ غسلهما بالماء الفاتر، يمكنك تطبيقه أكثر من مرّة حسب رغبتك، كما يمكنك إضافة زيت جوز الهند إلى الحليب واستخدامهما معاً",
    ),
    Recipe(
      id: 'm74',
      category: 'Eyes',
      title: 'الخيار ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "ضعي شرائح الخيار في الثلاجة لمدة 30 دقيقة ثم طبّقيها على عينيك واتركيها لمدة 10-15 دقيقة. كرّري الطريقة مرتين يوميا كي تلاحظي النتائج. يمكنك أيضا خلط أجزاء متساوية من عصير الليمون وعصير الخيار، ووضعها حول العينين لمدة 10-15 دقيقة",
    ),
    Recipe(
      id: 'm75',
      category: 'Eyes',
      title: 'الخيار',
      subtitle: 'انتفاخ العين',
      steps:
          "قطعي ثمرة من الخيار إلى شرائح سميكة ثم ضعيها في البراد لمدة عشر دقائق، بعد ذلك طبقيها على جفونكِ واتركيها لمدة عشر دقائق، ويٌفضل أن تكرري هذه الوصفة لعدة مرات في اليوم حتى تحصلي على نتائج سريعة",
    ),
    Recipe(
      id: 'm76',
      category: 'Eyes',
      title: 'الزّيوت الطبيعيّة لتطويل الرّموش',
      subtitle: 'تطويل الرموش',
      steps:
          "احرصي على استخدام الزّيوت الطبيعيّة التي تعمل على تطويل الرّموش، ومنها زيت الخروع وزيت الكافور. ضعي كمّية قليلة من زيت الخروع أو زيت الكافور في راحة يدك لتدفئة الزّيت، ثم اغمسي أصبعك في الزّيت ودلكي رموشك، مع الحرص على عدم وصول الزّيت إلى داخل العين لتجنّب حدوث الالتهابات",
    ),
    Recipe(
      id: 'm77',
      category: 'Eyes',
      title: 'الصّبار',
      subtitle: 'تكثيف الحواجب',
      steps:
          "اطحني بضع أوراق الصّبار ببطء لتستخرجي عصيره ثمّ دلكي حاجبيكِ به، اتركيه عليهما أطول فترة ممكنة، فللصّبارالقدرة على شفاء ونمو الجلد إن كان الحاجبان خفيفين بسبب حساسيّة فيه",
    ),
    Recipe(
      id: 'm78',
      category: 'Eyes',
      title: 'الطماطم ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "امزجي كمية متساوية من عصير الطماطم وعصير الليمون، وطبّقيها حول عينيك باستخدام قطعة صغيرة من القطن واتركيها لمدة 10 دقائق، ثم اشطفيها بالماء. كرّري العملية يوميا ستساعد هذه الطريقة في ازالة الهالات السوداء نهائيا",
    ),
    Recipe(
      id: 'm79',
      category: 'Eyes',
      title: 'العسل وزيت اللوز',
      subtitle: 'تطويل الرموش',
      steps:
          "امزجي الزّيت مع العسل، وضعي الخليط في علبة ماسكارا قديمة وفارغة ثم ادهني به رموشك يومين مُتتاليين ثم سترين الفرق",
    ),
    Recipe(
      id: 'm80',
      category: 'Eyes',
      title: 'الفازلين',
      subtitle: 'تطويل الرموش',
      steps:
          "خفّفي قوام الفازلين بالزّيت ليسهل التّعامل معه، استخدمي فرشاة ماسكارا قديمة لوضع الفازلين على الرّموش، اتركيها ليلاً، واغسليها صباحاً. كرّري هذه الخلطة ثلاث مرّات أسبوعيّاً",
    ),
    Recipe(
      id: 'm81',
      category: 'Eyes',
      title: 'الفراولة',
      subtitle: 'انتفاخ العين',
      steps:
          "ضعي بعضاً من حبات الفراولة في البراد واتركيها لمدة نصف ساعة، بعد ذلك أخرجيها من البراد وقطعيها إلى شرائح سميكة، ثم استلقي وضعي الشرائح تحت العينين لدقائق قليلة، حيث تحتوي الفراولة على حمض ألفا هيدروكسيدي الذي يساعد على تقليل انتفاخ العينين.",
    ),
    Recipe(
      id: 'm82',
      category: 'Eyes',
      title: 'الكركم ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "يحتوي الكركم على العديد من الخصائص الرائعة لمحاربة الهالات السوداء. أخلطي نصف ملعقة من مسحوق الكركم مع القليل من عصير الأناناس، وطبّقيها حول عينيك لمدة 10 دقائق. كرّري العملية يوميا وستلاحظي النتائج",
    ),
    Recipe(
      id: 'm83',
      category: 'Eyes',
      title: 'الكمادات البارده ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "اغمسي قطعة قماش نظيفة في وعاء من الماء أو الحليب البارد لمدة 2-3 دقائق، ثم تطبيقها حول عينيك واتركيها لمدة 3-5 دقائق. طريقة أخرى بسيطة، قومي بتطبيق كيس من البازلاء المجمدة أو أكياس الشاي المثلجة أو ملعقة معدنية باردة أو وضع 2-4 مكعبات الثلج في منديل ناعم حول العينين، كرّري العملية 3-4 مرات يوميا كي تلاحظي النتائج. تساعد الكمادات البارد في تقلل انقباض الأوعية الدموية وإنتفاخ الهالات السوداء",
    ),
    Recipe(
      id: 'm84',
      category: 'Eyes',
      title: 'الماء البارد',
      subtitle: 'تطويل الرموش',
      steps:
          "اغسلي عينيك بالماء البارد يوميّاً؛ لأنّ الماء البارد يعمل على إنعاش العيون والرّموش، كما يُقلّل من الإحساس بالالتهاب أو الاحمرار في العين",
    ),
    Recipe(
      id: 'm85',
      category: 'Eyes',
      title: 'الماء البارد',
      subtitle: 'انتفاخ العين',
      steps:
          "اشطفي وجهكِ بماءٍ مثلّج وذلك لعدة مرات في اليوم الواحد، أو ضعي كمية من الثلج في قطعة من القماش ثم ضعيها على عينيكِ، وكرري هذه الوصفة حتى يزول الانتفاخ نهائياً",
    ),
    Recipe(
      id: 'm86',
      category: 'Eyes',
      title: 'الماء المالح',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "اخلطي أربعة أكواب من الماء الفاتر ونصف ملعقة صغيرة من الملح، ثم أحضري كراتٍ من القطن وانقعيها بالمحلول الناتج لديكِ بعد ذلك ضعيها على جفونك واتركيها لعدة دقائق، وكرري هذه العملية لمدة تتراوح ما بين ربع ساعة وعشرين دقيقة",
    ),
    Recipe(
      id: 'm87',
      category: 'Eyes',
      title: 'بذور الحلبة',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "قومي بنقع ملعقتين صغيرة من بذور الحلبة في الماء لمدة 3-5 ساعات، ثم اطحنيها واضيفي إليها نصف ملعقة من مسحوق الكركم وملعقة صغيرة من الحليب، وطبّقيها على المنطقة المتضررة واتركيها لمدة 15- 20 دقيقة ثم تشطف بالماء البارد. استخدمي الطريقة يوميا حتى تختفي الهالات السوداء",
    ),
    Recipe(
      id: 'm88',
      category: 'Eyes',
      title: 'بياض البيض',
      subtitle: 'انتفاخ العين',
      steps:
          "افصلي بياض البيض عن الصفار، ثم اخفقي البياض بشكلٍ جيد حتى يصبح كثيفاً، بعد ذلك أضيفي أربع قطرات من زيت علاجي واخلطي المكونات مع بعضها جيداً، ثم أحضري قطعة قماش ناعمة الملمس واستخدميها لتطبيق المزيج على عينيكِ واتركيه حتى يجف تماماً، ويجب أن تكرري هذه الوصفة لعدة أيام متتالية حتى تتخلصي من الانتفاخ.",
    ),
    Recipe(
      id: 'm89',
      category: 'Eyes',
      title: 'زيت الجرجير',
      subtitle: 'تكثيف الحواجب',
      steps:
          "له فوائد عديدة وخاصّة في تقويّة الشّعر، ويمكنك الحصول عليه من خلال عصر الجرجير، وبعد ذلك اتركيه في إناء حتّى يتصفّى ما به من زيوت في قاع الإناء، وخذي ذلك الزّيت وضعيه على الحواجب مرّة أسبوعياً",
    ),
    Recipe(
      id: 'm90',
      category: 'Eyes',
      title: 'زيت الخروع مع عجوة التمر',
      subtitle: 'تطويل الرموش',
      steps:
          "خذي حبّات عجوة التّمر واحرقيهم على النّار، ثمّ اطحنيهم واخلطيهم مع زيت الخروع، وضعيهم في عبوة ماسكارا فارغة، وضعي من الخليط قبل النّوم مدّة أسبوع لتحصلي على نتائج مذهلة.",
    ),
    Recipe(
      id: 'm91',
      category: 'Eyes',
      title: 'زيت الزّيتون',
      subtitle: 'تكثيف الحواجب',
      steps:
          "والذي يُعدّ من أكثر الزّيوت تأثيراً على نموّ وكثافة الشّعر، ضعي القليل من زيت الزّيتون على قطعة من القطن ودلّكي بها الحواجب مرّتين يوميّاً، وللحصول على نتائج مُبهرة داومي على هذه الطّريقة مدّة أسبوعين.",
    ),
    Recipe(
      id: 'm92',
      category: 'Eyes',
      title: 'زيت اللوز',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "دلكي القليل من زيت اللوز بلطف لمدة 3-4 دقائق على المنطقة المصابة، ثم أتركيها بين عشية وضحاها. استخدمي العملية يوميا وستلاحظي الفرق في فترة قصيرة. طريقة أخرى رائعة، قومي بمزج 5-6 قطرات من زيت اللوز مع ملعقة كبيرة من العسل الخام وتطبيقها حول العينين قبل النوم، وقومي بغسلها في الصباح اليوم التالي",
    ),
    Recipe(
      id: 'm93',
      category: 'Eyes',
      title: 'زيت جوز الهند ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "دلكي القليل من زيت جوز الهند حول عينيك قبل النوم لمدة 2-3 دقائق واتركيه بين عشية وضحاها، ثم اشطفيه في الصباح التالي. كرّري العملية يوميا حتى تظهر النتائج سيساعد زيت جوز الهند في ترطيب وامتصاص فائض الزيت من على البشرة",
    ),
    Recipe(
      id: 'm94',
      category: 'Eyes',
      title: 'زيت جوز الهند وزيت الخروع',
      subtitle: 'تكثيف الحواجب',
      steps:
          "للحصول على حاجب كثيف بشكل مُرتّب، وتعزيز نموّه وتغذية بصيلاته، استخدمي خليط زيت جوز الهند والخروع، ولعمل هذا الخليط اخلطي كمّيات متساوية من الزّيتين وادهنيه على حاجبيك ليعمل تعزيز نموّ الشّعر وتكثيفهما، مع الحرص على المداومة على هذه الخلطة حتّى تُلاحظي النّتائج",
    ),
    Recipe(
      id: 'm95',
      category: 'Eyes',
      title: 'عجوة التمر',
      subtitle: 'تكثيف الحواجب',
      steps:
          "خذي أربع أو خمس حبات واحرقيهم على النّار حتى يصبح لونها أسود، ومن ثمّ اطحنيها واخلطيها مع القليل من زيت الخروع واحفظيها في علبة صغيرة، ادهني الحواجب بهذا الخليط يوميّاً مع إمكانيّة تكريرها في اليوم أكثر من مرّة. كما أنّه بإمكانك حرق نواة التّمر إلى أن يصبح لونها أسود، ومن ثمّ اطحينها واخلطيها مع القليل من ماء الورد، واستخدميها كما فعلتِ في خليط التّمر والخروع",
    ),
    Recipe(
      id: 'm96',
      category: 'Eyes',
      title: 'عصير البصل',
      subtitle: 'تكثيف الحواجب',
      steps:
          "يساعدك عصير البصل على تحفيز نمو الشّعر في الحاجبين أو غيرهما، استخدمي قطعة من القطن المُشبعة بعصير البصل وافركي الجلد أسفل الحاجبين برفق. تعطي هذه الطّريقة منظراً أجمل للحواجب الخفيفة",
    ),
    Recipe(
      id: 'm97',
      category: 'Eyes',
      title: 'عصير ليمون ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "طبيقي بضع قطرات من عصير الليمون باستخدام قطنة حول عينيك واتركيها لمدة 10 - 15 دقيقة. يمكنك أيضا مزج ملعقة كبيرة من عصير الليمون مع 2-3 ملاعق كبيرة من معجون الطماطم والقليل من الطحين والكركم. خلط المكونات جيدا، وتطبيقها حول العينين واتركيها لمدة 10 - 15 دقيقة. كرّري الطريقة ثلاث مرات أسبوعيا لتتخلصي نهائيا من الهالات السوداء",
    ),
    Recipe(
      id: 'm98',
      category: 'Eyes',
      title: 'ماء الورد ',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "يساعد ماء الورد في تفتيح الهالات السوداء وتقوية وتجديد خلايا الجلد والانسجه. ببساطة قومي بنقع قطنة في القليل من ماء الورد لمدة 2-3 دقائق. الآن، ضعيها حول عينيك لمدة 15 دقيقة. كرّري العملية مرتين يوميا وخلال فترة قصيرة ستحصلين الفرق. طريقة أخرى رائعة، امزجي ماء الورد مع الحليب البارد في وعاء وقومي بنقع قطعة صغيرة من القطن في المزيج واتركيها لمدة 2-3 دقائق، ثم طبّقيها على عينيك لمدة 15 - 20 دقيقة",
    ),
    Recipe(
      id: 'm99',
      category: 'Nails',
      title: 'عصير البرتقال',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "اهرسي الأفوكادو مع ماء الورد، وضعي العجينه على أظافرك لمدة 15-25 دقيقة، ثم اشطفيه جيدا وضعي كريم مرطب اليد، إستعملي هذه الخلطه  كل يوم حوالي أسبوعين",
    ),
    Recipe(
      id: 'm100',
      category: 'Nails',
      title: 'الأفوكادو',
      subtitle: 'الهالات السوداء حول العينين',
      steps:
          "اهرسي الأفوكادو مع ماء الورد، وضعي العجينه على أظافرك لمدة 15-25 دقيقة، ثم اشطفيه جيدا وضعي كريم مرطب اليد، إستعملي هذه الخلطه  كل يوم حوالي أسبوعين.- تطويل الاظافر بسرعة",
    ),
    Recipe(
      id: 'm101',
      category: 'Nails',
      title: 'البروتين',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "الأظافر تتكون من الكيراتين، وهو بروتين. عن طريق إضافة المزيد من البروتين في نظامك الغذائي وبذلك يمكنك تعزيز نمو الأظافر. نقص البروتين يمكن أن يسبب بقع بيضاء على الأظافر ويجعلها ضعيفة. أكل الدواجن الخالية من الدهون، السمك ولحم البقر، وكذلك البيض لزيادة كمية البروتين الخاص. البقوليات، المكسرات، والبذور، والسبانخ والخضار الخضراء أيضا البروتين. يمكنك أيضا إضافة مسحوق البروتين إلى كوب من الحليب. استشارة الطبيب قبل تناول أي مكملات البروتين",
    ),
    Recipe(
      id: 'm102',
      category: 'Nails',
      title: 'الثوم',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "للثوم فوائد عديدة منها تطويل الأظافر، ببساطة اعصري الثوم بواسطة الضغط عليه بملعقة، ثم طبيقي العصير المستخرج منه على أظافرك يومياً قبل النوم، ستحصلين على أظافر طويله في مده قصيرة",
    ),
    Recipe(
      id: 'm103',
      category: 'Nails',
      title: 'الحليب',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "ضعي الحليب الدافئ في وعاء، وانقعي أظافرك لمدة 5 دقائق ثم اشطفيه جيدا وضعي كريم مرطب اليد، كرري هذه العملية كل يوم حوالي أسبوعين.",
    ),
    Recipe(
      id: 'm104',
      category: 'Nails',
      title: 'الطماطم',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "اخلطي نصف كوب من عصير الطماطم وملعقتين طعام من زيت الزيتون، انقعي أظافرك في الوعاء لمدة 10 دقائق، كرري الوصفة مرة واحدة يوميا،  ستحصلين على أظافر طويله في مده قصيرة",
    ),
    Recipe(
      id: 'm105',
      category: 'Nails',
      title: 'الطماطم',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          '''الطماطم تحتوي على كمية عالية من البيوتين الذي يساعد في تطويل الأظافر وكذلك يجعلها سميكة ولامعة. بالاضافة الى ذلك
   الطماطم تحتوي على فيتامينات
A و C
التي لا غنى عنها للأظافر صحية. كل ما عليك فعله هو خلط نصف كوب من عصير الطماطم و 2 ملاعق طعام من زيت الزيتون في وعاء، ثم نقع أظافرك في هذا الحل لمدة 10 دقائق. اتبعي هذه العملية مرة واحدة يوميا حتى الحصول على النتائج المرجوة
''',
    ),
    Recipe(
      id: 'm106',
      category: 'Nails',
      title: 'الليمون',
      subtitle: 'تطويل الاظافر بسرعة',
      steps: ''' c الليمون يحتوي على فيتامين  
      الذي يعتبر ضروريا للنمو وتقوية الأظافر. أيضا، يساعد في التخلص من صفار الأظافر وإعطائها التألق اللطيف. قومي بخلط 1 ملعقة كبيرة من عصير الليمون و 3 ملاعق كبيرة من زيت الزيتون. سخني هذه المكونات في الميكروويف ثم نقع أظافرك لمدة 10 دقائق. اتبعي هذا العلاج يوميا. يمكنك أيضا فرك شريحة من الليمون على أظافرك لمدة 5 دقائق، ثم شطفه بالماء الدافئ وتطبيق المرطب. كرري العملية مرة واحدة يوميا
''',
    ),
    Recipe(
      id: 'm107',
      category: 'Nails',
      title: 'الليمون',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "فهو يساعدك في زيادة حجم الأظافرك وتقويتها وتطويلها بشكل كبير. قطعي ليمونه إلى نصفين وقومي بفركها على أظافرك بواسطة فرشاة أسنانك القديمه لمدة عشردقائق، ثم أغسلي يديك بالماء الفاترو جففيهم جيداً",
    ),
    Recipe(
      id: 'm108',
      category: 'Nails',
      title: 'زيت الزيتون',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "يساعد زيت زيتون في تطويل الاظافر وجعلها تبدو مثالية وبراقة في مده قصيره لانه يحتوي على فيتامينات أ,ك,د,هـ. مما يكون له تأثير مضاد للأكسدة في جسم الإنسان.لذلك، نجد أن فوائد زيت الزيتون للجسم عديدة. ببساطة امزجي زيت الزيتون مع عصير الليمون، وانقعي أظافرك فى المزيج لمدة 15 دقيقة و قومي بتدليكها بزيت الزيتون الدافئ. طبيقي هذه الطريقة يومياً وستلاحظي الفرق",
    ),
    Recipe(
      id: 'm109',
      category: 'Nails',
      title: 'زيت الزيتون والعسل والبيض',
      subtitle: 'تقوية الأظافر',
      steps:
          "امزجي 4 ملاعق من زيت الزيتون  مع 2 ملاعق كبيرة من العسل وبياض بيضه أخلطى  جيدا جميع المكونات وأتركيها على أظافرك لمدة 10-15 دقيقة، ثم أغسلي  يديك  بالماء الدافئ (بدون استخدام الصابون).كرريها  حوالي مرتين في الأسبوع لمدة أسبوعين أو ثلاث ستحصلين على أظافرأكثر مرونة وأقل هشاشة",
    ),
    Recipe(
      id: 'm110',
      category: 'Nails',
      title: 'زيت جوز الهند',
      subtitle: 'تطويل وتقوية الأظافر',
      steps:
          "زيت جوز الهند يعمل بشكل جيد لنمو الأظافر صحية. كما أنه يحتوي على العناصر الغذائية الهامة للحفاظ على الأظافر رطبه وقوية. كما أنه يقوي البشرة والتي تلعب دورا رئيسيا في تطويل الأظافر. بالإضافة إلى ذلك، فإنه يساعد في علاج التهابات البشرة والأظافر الفطرية. كل ما عليك القيام به هو تدليك الأظافر واليدين بزيت جوز الهند يوميا في الليل، قبل الذهاب إلى السرير. والتدليك في حركات دائرية لتحسين الدورة الدموية. يمكنك أيضا خلط ربع كوب من زيت جوز الهند العضوي مع ربع كوب من العسل و 4 قطرات من الزيت العطري روزماري. قومي بتدفئة هذه المزيج في الميكروويف لمدة 20 ثانية. بعض ذلك يمكنك نقع أظافرك في الخليط لمدة 15 دقيقة. اتبعي هذا العلاج مرة أو مرتين في الأسبوع",
    ),
    Recipe(
      id: 'm111',
      category: 'Nails',
      title: 'زيت جوز الهند، زيت الزيتون وعصير الليمون',
      subtitle: 'تطويل الاظافر بسرعة',
      steps:
          "زيت جوز الهند وزيت الزيتون لديهم العناصر الغذائية الهامة التي تعزز الأظافر والبشرة، الليمون يعمل كعامل تبييض طبيعي يزيل البقع ويترك الأظافر لامعة. اخلطي ملعقه زيت جوز الهند وزيت الزيتون وعصير الليمون أظيفى إليها نصف ملعقه من الماء الدافئ، انقعي أظافرك لمدة 15 - 20 دقيقة، ثم اشطفيها جيدا وضعي كريم مرطب اليد.  كرري الطريقة كل يوم حوالي أسبوعين للحصول على أفضل النتائج",
    ),
    Recipe(
      id: 'm112',
      category: 'Nails',
      title: 'شمع النحل',
      subtitle: 'تقوية الأظافر',
      steps:
          "يمكنك الحصول عليه في المتاجر، ذوبي بضعة غرامات من الشمع وامزجيه مع صفار بيضه و القليل من الزيت العطري حسب الرغبه، ثم افركي بالخليط المناطق الهشة ستحصلين على أظافر قوية و غير قبله للكسر",
    ),
    Recipe(
      id: 'm113',
      category: 'Nails',
      title: 'عصير الليمون وزيت الزيتون',
      subtitle: 'تقوية الأظافر',
      steps:
          "أعدي 3 ملاعق من زيت الزيتون مع  ملعقة من عصير الليمون، وضعيها على أظافرك لمدة 10-15 دقيقة ثم اشطفيها  بالماء. استخدمىهذا العلاج مرة واحدة أو مرتين في الأسبوع خلال 3 أسابيع ستحصلين على أظافر قويه و سترين الفرق",
    ),
    Recipe(
      id: 'm114',
      category: 'Nails',
      title: 'عصير الليمون وملح البحر',
      subtitle: 'تقوية الأظافر',
      steps:
          "أخلطي ملعقة  من ملح البحر وعصير الليمون الطازج مع نصف كأس من الماء الدافئ ثم  انقعي أظافرك في المزيج واتركيه لمدة 15 دقيقة، ثم اشطفيه جيدا وضعي كريم مرطب  اليد أويمكنك أيضا استخدام زبدة الشيا و لك الإختيار. إستعملي هذه الخلطه  كل يوم حوالي أسبوعين ، ستحصلين على أظافر أقوى.",
    ),
    Recipe(
      id: 'm115',
      category: 'Hair',
      title: 'أوراق الكاري وجوز الهند',
      subtitle: 'علاج الشيب المبكر',
      steps:
          "إغلي حفنه من أوراق الكاري مع كأس من زيت جوز الهند لمدة 6 إلى 8 دقائق حتى تتحول الأوراق إلى اللون الأسود. صفي الزيت بعد أن يبرد وضعيه في وعاء. دلكي شعرك وفروة رأسك بالزيت من ثلاث إلى أربعة مرات في الأسبوع قبل الذهاب إلى النوم واغسليه في اليوم التالي بشامبو الأعشاب",
    ),
    Recipe(
      id: 'm116',
      category: 'Hair',
      title: 'تباع نظام غذائي متوازن',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "من المهم جدا اتباع نظام غذائي متوازن ومغذي لمنع تساقط الشعر. تأكدي من زيادة كمية الحديد، والفيتامينات والمعادن في نظامك الغذائي اليومي للمساعدة في علاج تساقط الشعر. وعليك إستهلاك الكثير من الخضر والخضروات في نظامك الغذائي الصحي للحد من هذه المشكلة",
    ),
    Recipe(
      id: 'm117',
      category: 'Hair',
      title: 'الأطعمة الغنية بالحديد',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الحديد ناقل الأكسجين داخل الجسم ونقصه يمكن أن يقلل من وصول الأوكسجين إلى رأسك هذا يؤدي إلى ضعف الدورة الدموية والتي بدورها ستؤدي بالتأكيد إلى مشاكل الشعر بما في ذلك فقدان الشعر. عليكي بإتباع  هذا النظام الغذائي مثل صفار البيض،لحم أحمر، الخضار الورقية الخضراء، الفواكه الجافة مثل الخوخ والزبيب، الرخويات ، المحار، والاسكالوب، الفاصوليا والعدس وفول الصويا والحمص والكبد. كل منها غنية بالحديد للتخلص من تساقط الشعر",
    ),
    Recipe(
      id: 'm118',
      category: 'Hair',
      title: 'الأطعمة الغنية بالزنك',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "نقص الزنك هو أحد الأسباب الرئيسية لفقدان الشعر. الزنك يبني البروتينات الضرورية جدا لنمو الشعر، ويخلق الحمض النووي ويعزز نمو الأنسجة وإصلاحها. كما ينظم الهرمونات التي تتضمن هرمون التستوستيرون لعلاج تساقط شعرك فبإتباع هذا النظام الغذائي مثل الأغذية البحرية ، المحار وسرطان البحر، لحوم البقر الخالية من الدهون، القمح، السبانخ، اليقطين والقرع وبذور عباد الشمس، الجوز والدجاج كل منهم يحتوي على الزنك لمنع تساقط الشعر",
    ),
    Recipe(
      id: 'm119',
      category: 'Hair',
      title: 'الأفوكادو ',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "اهرسي ثمرة أفوكادو واضيفي إليها ملعقة صغيرة من زيت الجوجوبا وزيت جنين القمح. أخلطي المكونات جيدا، وطبّقيها على الشعر الرطب من الجذور إلى الأطراف ويغطى لمدة 30 دقيقه، ثم يشطف بالماء الفاتر  والشامبو. كرّري الطريقة مرتين في الأسبوع. تساعد هذه الخلطة في تنعيم وترطيب وعلاج تلف وجفاف الشعر",
    ),
    Recipe(
      id: 'm120',
      category: 'Hair',
      title: 'الأفوكادو ',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "الأفوكادو من أفضل العلاجات للشعر لسنوات طويلة وهو يساعد أيضا في تطويل وتكثيف الشعر بشكل ممتاز. دلكي مزيج ثمرة الأفوكادو وزيت جوز الهند على فروة رأسك، وأتركيه لمدة عشر الى خمس عشرة دقيقة، من ثم اشطفيه بالماء",
    ),
    Recipe(
      id: 'm121',
      category: 'Hair',
      title: 'لأفوكادو والموز',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "اهرسي موزة وثمرة أفوكادو واخلطيها جيدا معا. طبيقي الخليط على فروة رأسك ودلكيه بلطف ثم أتركيه لمدة نصف ساعة بعدها قومي بغسله بالماء والشامبو ستلاحظين أن شعرك يبدو أكثر كثافة بمجرد أن يجف. كرّري العلاج مرتين إلى ثلاث مرة في الأسبوع. يمكن أيضا خلط ملعقتين من زيت الزيتون مع نصف ثمرة أفوكادو مهروسه. تطبيق الخليط على شعر المغسول بالشامبو حديثاً ويترك لمدة 20 دقيقة على فروة الرأس، ثم غسله",
    ),
    Recipe(
      id: 'm122',
      category: 'Hair',
      title: 'الألو فيرا',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الألو فيرا تحتوي على الانزيمات التي تعزز مباشرة نمو الشعر الصحي. الاستخدام المنتظم للصبار يخفف حكة فروة الرأس، ويحد من احمرار الفروة والالتهابات، ويضيف القوة واللمعان للشعر، كما يخفف قشرة الرأس. طبيقي هلام الألوة فيرا على فروة رأسك، اتركيه لمدة 3 ساعات ثم اغسليه بالماء الفاتر، كرري هذه العملية ثلاث إلى أربع مرات في الأسبوع",
    ),
    Recipe(
      id: 'm123',
      category: 'Hair',
      title: 'الألوة فيرا',
      subtitle: ' تطويل وتكثيف الشعر',
      steps:
          "الألوة فيرا والبيض معا يمكن أن يفعل العجب للشعر. امزجي هذه المكونات واتركيها لمدة ساعة على فروة رأسك، من ثم اغسليها بالماء العادي. كرري العلاج بشكل منتظم لتحصلين على شعر طويل وكثيف",
    ),
    Recipe(
      id: 'm124',
      category: 'Hair',
      title: 'الألوة فيرا والبيض',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "قطعي اثنان أو ثلاثة من أوراق الألوة فيرا إلى نصفين وقومي بستخرج الجل منها وضعيه على فروة رأسك لمدة نصف ساعة، ثم اشطفيه جيدا بالماء الفاتر. طريقة أخرى بسيطة ؛  أخلطي جل الألوة فيرا مع بيضه. طبيقي الخليط على فروة رأسك واتركيه لمدة خمسة عشر إلى عشرين دقيقة، ثم اغسليه بالشامبو. استخدمي العلاج مرة أو مرتين في الأسبوع لتتمتعي بشعر أكثر كثافة وقوة",
    ),
    Recipe(
      id: 'm125',
      category: 'Hair',
      title: 'الإفراط في  تجفيف شعرك',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "تجنّبي الإفراط في تجفيف الشعر بالمجفف وحاولي تجفيفه بطريقة طبيعية كلّما أمكن ذلك، فمن شأن ذلك أن يساعد على منع تقصّف أطراف الشعر كذلك التخلص من جفافه والإفراط في تجفيف الشعر سيضر بصيلات الشعر ويؤدي إلى جفاف فروة الرأس",
    ),
    Recipe(
      id: 'm126',
      category: 'Hair',
      title: 'البرتقال',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "البرتقال هو أيضا فعال جدا في علاج مشاكل القشرة وفروة الرأس الدهنية. أخلطي كمية متساوية من عصير البرتقال وهريس التفاح، وضعيه على شعرك لتحصلين على شعر أطول واكثر كثافة في خلال أسبوع",
    ),
    Recipe(
      id: 'm127',
      category: 'Hair',
      title: 'البرتقال',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "أخلطي أجزاء متساوية من عصير البرتقال والتفاح المهروس وضعيها على فروة رأسك وشعرك لمدة 30 دقيقة، ثم اغسليه بالماء وكرّري العلاج مرة في الأسبوع لشعر أكثر كثافة. طريقة أخرى رائعة ببساطة ضعي قشر البرتقال في الخلاط، من ثم طبّقيها على شعرك لمدة 15 إلى 20 دقيقة ثم اغسليه. يمكن أيضا وضع كمية متساوية من عصير البرتقال وزيت الزيتون على نار لبعض الوقت، بعدها طبيقي المزيج على فروة رأسك وشعرك لمدة نصف ساعة واغسليه كالمعتاد",
    ),
    Recipe(
      id: 'm128',
      category: 'Hair',
      title: 'البرسيم والجزر والخس ',
      subtitle: ' علاج الشيب المبكر',
      steps:
          "شرب عصير البرسيم والجزر والخس يومياً يساعد في علاج الشيب المبكر وتساقط الشعر. تحتوي هذه العصائر على العديد من المعادن والفيتامينات التي تساعد في تقوية ونمو الشعر الصحي",
    ),
    Recipe(
      id: 'm129',
      category: 'Hair',
      title: 'البصل وعصير الليمون',
      subtitle: ' علاج الشيب المبكر',
      steps:
          "يساعد عصير البصل وعصير الليمون في علاج الشيب المبكر والشعر الدهني. امزجي 3 ملاعق صغيره من عصير البصل و3 ملاعق صغيره من عصير الليمون في وعاء. طبيقي المزيج على فروة رأسك وشعرك بالتساوي واتركيه لمدة 30 دقيقة، من ثم اغسليه. استخدمي العلاج أربعة إلى خمس مرات في الأسبوع لمدة أسبوعين",
    ),
    Recipe(
      id: 'm130',
      category: 'Hair',
      title: 'البطاطس',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "البطاطا تحتوي على البوتاسيوم، وفيتامين ج، والحديد، وكلها حيوية للحفاظ على صحة الشعر. وقد تبين أيضا أن نقص البوتاسيوم يمكن أن يؤدي إلى تساقط الشعر. قومي بغسل البطاطس جيدا وتقشير جلدها، قطعيها الى قطع صغيرة وضعيها في الخلاط ويمكنك إضافة كمية قليلة من الماء الى الخليط إذا كان سميك جدا، ثم أضيفي إليها ملعقة من العسل وملعقة صغيرة ماء، ضعي الخليط على فروة الرأس والشعر، اتركيه لمدة 30 دقيقة، ثم اغسلى بشامبو خفيف. كرري العملية مرة واحدة في الأسبوع",
    ),
    Recipe(
      id: 'm131',
      category: 'Hair',
      title: 'البيض',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "اخفقي بيضتين وطبّقيها على الشعر الرطب واتركيها لمدة 10 إلى 15 دقيقة، ثم اغسليه جيدا بالماء الفاتر لتتخلصي من رائحة البيض. كرّري العملية ما لا يقل عن 3-4 مرات في الأسبوع لتحصلي على شعر كثيف وقوي في فترة قصيرة. طريقة بسيطة أخرى امزجي صفار بيضة مع ملعقة كبيرة من أي زيت متاح لديكي وملعقتين من الماء. قومي بتدليك المزيج على فروة رأسك لمدة عشر دقائق، ثم أتركيه لمدة 10 دقائق أخرى بعدها اغسليه. استخدمي الطريقة مرة في الأسبوع للحصول على أفضل النتائج",
    ),
    Recipe(
      id: 'm132',
      category: 'Hair',
      title: 'البيض واللبن الرائب',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "قومي بمزج بياض بيضتان في وعاء وأضيفي ملعقتين من اللبن الرائب الطازج و ملعقة كبيرة من مسحوق النيم، طبيقي هذا الخليط على فروة رأسك ويترك لمدة 30 دقيقة، ثم اشطفي شعرك. كرري العملية كل أسبوع لعلاج تساقط الشعر",
    ),
    Recipe(
      id: 'm133',
      category: 'Hair',
      title: 'البيض وزيت الزيتون ',
      subtitle: ' تنعيم الشعر الخشن',
      steps:
          "أخلطي بيضتين مع أربع ملاعق كبيرة من زيت الزيتون. طبيقي الخليط على فروة رأسك وشعرك وقومي بتمشيطه جيدا، ثم غطيه بقبعة دش لمدة 30 إلى 45 دقيقة واغسليه بالشامبو خفيف",
    ),
    Recipe(
      id: 'm134',
      category: 'Hair',
      title: 'الثعلب الهندي',
      subtitle: 'علاج تساقط الشعر',
      steps: ''' C يمكنك استخدام عنب الثعلب الهندي فهو غني بفيتامين 
       وهو كذلك مضاد للالتهابات، ومضاد للأكسدة، مضاد للجراثيم، وخصائص التقشير في عنب الثعلب الهندي يمكن أن تساعد في الحفاظ على فروة الرأس صحية وتعزز نمو الشعر
قومي بخلط كل من عنب الثعلب الهندي وملعقة كبيرة من عصير الليمون. دلكي فروة رأسك مع هذا الخليط جيدا وغطي شعرك مع قبعة الدش، يترك بين ليلة وضحاها واشطفي شعرك بالشامبو في الصباح
''',
    ),
    Recipe(
      id: 'm135',
      category: 'Hair',
      title: 'الثوم',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "زيت الثوم هو معروف على نطاق واسع في علاج تقصف وتسريع نمو الشعر. قومي بغلي بضع من فصوص الثوم في زيت الزيتون وزيت جوز الهند، ودلكي المزيج جيدا على جذور شعرك ليساهم في تعزيز الدورة الدموية لفروة رأسك مما سيساعد في تطويل وتكثيف شعرك",
    ),
    Recipe(
      id: 'm136',
      category: 'Hair',
      title: 'الحلبة',
      subtitle: 'علاج تساقط الشعر',
      steps:
          '''الحلبة، والمعروفه أيضا باسم ميثي، فعالة للغاية في علاج تساقط الشعر. بذور الحلبة تحتوي على هرمون الذي يعزز نمو الشعر ويساعد في إعادة بناء بصيلات الشعر. كما أنها تحتوي على البروتينات وحمض النيكوتينيك التي تحفز نمو الشعر. انقعي كوب من بذور الحلبة في الماء طوال الليل، وفي الصباح، اطحني الحلبة حتى تصبح عجينة، طبيقي الخليط على فروة الرأس و الشعر، غطيه مع قبعة الدش، و بعد حوالي
40 دقيقة اشطفي شعرك جيدا. اتبعي هذا العلاج كل صباح لمدة شهر''',
    ),
    Recipe(
      id: 'm137',
      category: 'Hair',
      title: 'الحلبة',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "الحلبة هي عنصر فعال لزيادة طول وكثافة الشعر. ضعي بذور الحلبة ليلة كاملة في الماء، من ثم قومي بطحنها في اليوم التالي لتصبح على شكل عجينة. أضيفي إليها ملعقتين من الحليب العادي أو حليب جوز الهند، وطبّقيها كقناع على شعرك لمدة 45 دقيقة على الأقل، من ثم اغسليه. هذا القناع يعزز نمو وسماكة شعرك ويجعله ناعم كالحرير",
    ),
    Recipe(
      id: 'm138',
      category: 'Hair',
      title: 'الحناء',
      subtitle: 'علاج الشعر الدهني',
      steps:
          'استخدام الحناء لتكييف الشعر والتي لها تأثير التجفيف الذي هو مناسب لفروة الرأس الدهنية. قومي بخلط الزبادي في كوب من الحناء ومزجه على فروة الرأس. استخدمي هذه الخلطة مرة واحدة في غضون أسبوعين',
    ),
    Recipe(
      id: 'm139',
      category: 'Hair',
      title: 'الحناء',
      subtitle: 'علاج الشيب المبكر',
      steps:
          "قومي بطحن حفنة من أوراق الحناء واضيفي إليها ملعقة صغيرة من مسحوق القهوة والحليب واخلطيها جيدا. طبقي الخليط بالتساوي على شعرك واتركيه حتى يجف ثم اشطفيه. كرّري نفس العملية مرتين إلى أربعة مرات في الأسبوع حتى يختفي الشيب",
    ),
    Recipe(
      id: 'm140',
      category: 'Hair',
      title: 'لخل',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الخل يحتوي على البوتاسيوم والأنزيمات الأخرى التي تعزز نمو الشعر وتحارب قشرة الرأس. كل ما عليك القيام به بعد غسل شعرك، اشطفيه بالماء مع الخل لمدة 10-15 دقيقة أو إن أردت اتركيه حسب رغبتك",
    ),
    Recipe(
      id: 'm141',
      category: 'Hair',
      title: 'الزبادي',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "تساعد الزبادي في تنعيم الشعر وتنظيف فروة الرأس. ضعي الزبادي على شعرك وقومي بتمشيطه جيدا بمشط واسع الأسنان. غطي شعرك بمنشفة لمدة 30 دقيقة على الأقل، ثم يغسل جيدا بالماء. استخدمي الطريقة مرة في الأسبوع",
    ),
    Recipe(
      id: 'm142',
      category: 'Hair',
      title: 'الزبادي اليونانية',
      subtitle: 'تنعيم الشعر الخشن',
      steps: ''' B5  الزبادي اليوناني مكيف طبيعي للشعر وهو يحتوي على فيتامين
      والبروتينات التي هي مفيدة للغاية للشعر كما يحتوي أيضا على البروبيوتيك مما يسهل نمو الشعر. والعسل يحتوي على خصائص مضادة للجراثيم التي تحمي الشعر من التلف. امزجي ملعقتين من الزبادي اليوناني في وعاء وأضيفي العسل وعصير الليمون، اخلطي المكونات جيدا لصنع عجينة. استخدمي فرشاة صبغ الشعر، وطبقيه على فروة الرأس و الجذور. اتركيه لمدة 30 دقيقة، ثم اشطفيه جيدا بالماء البارد. يجب تطبيق هذه العملية مرة واحدة في الأسبوع ولكن إذا كان شعرك جاف، يمكنك استخدامه مرتين في الأسبوع
''',
    ),
    Recipe(
      id: 'm143',
      category: 'Hair',
      title: 'الزنجبيل',
      subtitle: 'علاج الشيب المبكر',
      steps:
          "أخلطي الزنجبيل المبشور مع القليل من الحليب. طبقي الخليط على الشعر الأبيض وافركيه لبعض الدقائق وقومي بتركه لمدة 10-15 دقيقة، من ثم اغسليه بالماء. كرّري العملية مرة واحدة يوميا لمدة أسبوع إلى 10 أيام للتخلص نهائيا من الشيب وإعادة اللون الطبيعي للشعر",
    ),
    Recipe(
      id: 'm144',
      category: 'Hair',
      title: 'الشاي',
      subtitle: 'علاج الشعر الدهني',
      steps:
          "بعد غسل الشعر بالشامبو، يمكنك شطف الشعر مع خليط الشاي المخفف. الشاي يحتوي على حامض التانيك الذي يعمل كمادة قابضة، ويحد من الزيت. لهذا، قومي بغلي أوراق الشاي في كوب من الماء. عندما يصبح الشاي فاتر، يمكنك تطبيقه على فروة الرأس والشعر، ويترك لبعض الوقت. ثم يشطف بالماء والشامبو",
    ),
    Recipe(
      id: 'm145',
      category: 'Hair',
      title: 'الشاي الأخضر',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الشاي الاخضر معروف لتحفيز بصيلات الشعر وزيادة إنتاج الشعر، كما أنه يزيد من التمثيل الغذائي، والذي تم ربطه بأنه مفيد في زيادة معدل نمو الشعر. ضعي 2 من أكياس الشاي الأخضر في الماء الساخن وانتظري حتى يبرد الماء قليلا، واستخدامي المحلول  لشطف شعرك مع التدليك لفروة رأسك. يمكنك استخدام محلول الشاي الأخضر بمثابة بلسم بعد الشامبو. كرري العملية مرتين في الأسبوع، وبعدها اغسلي شعرك بالشامبو",
    ),
    Recipe(
      id: 'm146',
      category: 'Hair',
      title: 'الشاي الأخضر',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "الشاي الأخضر هو مصدر طبيعي للمواد المضادة للتأكسد والتي تساعد في علاج تساقط الشعر. ضعي الشاي الأخضر الدافئ في جميع أنحاء فروة رأسك، من ثم اشطفيه بالماء البارد في صباح اليوم التالي",
    ),
    Recipe(
      id: 'm147',
      category: 'Hair',
      title: 'الشاي الأسود',
      subtitle: 'علاج الشيب المبكر',
      steps:
          "إغلي ملعقتين كبيرة من مسحوق الشاي الأسود وملعقة صغيرة من الملح لمدة دقيقتين بعدها أتركيه يبرد وصفيه. أغسلي شعرك بالسائل وخليه حتى يجف. كرّري العمليه مرتين أو ثلاث مرات في الأسبوع لتحصلي على نتائج ممتازة في أسرع وقت",
    ),
    Recipe(
      id: 'm148',
      category: 'Hair',
      title: 'الشمندر',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "أضيفي عصير الشمندر الطازج في نظامك الغذائي و يمكنم ايضا إضافة  عصير السبانخ وعصير البرسيم، عصير الخس، أو عصير الجزر فكل هذه المكونات تساعد في الحفاظ على شعر صحي او بدلا من ذلك، اطحني بضعة أوراق الشمندر ثم ضعيها في الماء المغلي جنبا إلى جنب مع الحناء وطبيقي العجينة على فروة رأسك. اتركيها لمدة 15 إلى 20 دقيقة قبل الشطف. كرري هذه العملية عدة مرات في الأسبوع",
    ),
    Recipe(
      id: 'm149',
      category: 'Hair',
      title: 'الشوفان',
      subtitle: 'علاج الشعر الدهني',
      steps:
          "الشوفان هو من الوسائل الطبيعية الفعاله لعلاج الشعر الدهني. يقوم بمص الزيت الزائد من فروة الرأس وكذلك يعمل على علاج الحكة. لهذا، قومي بإعداد دقيق الشوفان مع القليل من الماء ووضعه في الفرن، اتركيه ليبرد، ثم طبقي كمية منه على فروة الرأس ويترك لمدة عشر الى خمس عشرة دقيقة. ثم يشطف بالشامبو كالمعتاد",
    ),
    Recipe(
      id: 'm150',
      category: 'Hair',
      title: 'الصبار (الألوة فيرا)',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "أخلطي نصف كوب من جل الصبار مع ملعقتين صغير من زيت الخروع ومسحوق كل من الحلبة والريحان. طبقي الخليط على فروة رأسك، وتغطيته بقبعة دش وتركه لمدة ثماني ساعات ومن المستحسن قبل النوم وغسله في الصباح التالي. كرّري العمليه مرة في الأسبوع  لمدة بضعة أشهر لعلاج تساقط الشعر وتكثيفه",
    ),
    Recipe(
      id: 'm151',
      category: 'Hair',
      title: 'العسل',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "طبيقي نصف كوب أو أكثر من العسل على الشعر الرطب ودلكيه بلطف على فروة رأسك، وضعي عليه غطاء من البلاستيك لمدة نصف ساعة، ثم يشطف بالماء الدافئ. كرّري العملية مرتين في الأسبوع وتمتعي بشعر ناعم وقوي",
    ),
    Recipe(
      id: 'm152',
      category: 'Hair',
      title: 'العسل والبيض وزيت الزيتون',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "أضيفي ملعقة من العسل وزيت الزيتون إلى بياض بيضة في وعاء، ومزاجي المكونات جيدا حتى تصبح على شكل عجينة. ضعي الخليط على شعرك، واتركيه لمدة 20 دقيقة، ثم اشطفيه بالماء البارد والشامبو. كرري العملية بانتظام وسترين الفرق",
    ),
    Recipe(
      id: 'm153',
      category: 'Hair',
      title: 'العسل وزيت الزيتون',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "أضيفي ملعقتين من العسل وملعقتين من زيت الزيتون في وعاء، اخلطي المزيج جيدا ثم أضيفي ملعقة كبيرة من مسحوق القرفة الطازجة واجعليها عجينة ناعمة. طبيقي هذا الخليط  على فروة رأسك وشعرك لمدة 20 إلى 25 دقيقة، ثم اشطفيه جيدا، تطبيق هذا الخليط على فروة رأسك بانتظام كل أسبوع يعطيك نتائج ملموسة. هذه العملية ستساعدك في نمو شعر جديد",
    ),
    Recipe(
      id: 'm154',
      category: 'Hair',
      title: 'الكاري والكركديه',
      subtitle: 'كثيف الشعر الخفيف',
      steps:
          "اهرسي حفنة من أوراق الكاري والكركديه واضيفي إليها بعض الماء لتصبح على شكل عجينة. طبيقي زيت الأملا أو جوز الهند أو أي من الزيوت الأساسية على شعرك. بعدها قومي بوضع القناع واتركيه لمدة 30 دقيقة ثم اشطفيه بالشامبو. كرّري الطريقة مرة أو مرتين أسبوعيا على الأقل لمدة 3-4 أسابيع لتتمتعي بشعر كثيف وصحي",
    ),
    Recipe(
      id: 'm155',
      category: 'Hair',
      title: 'النعناع ',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "النيم له خصائص مضادة للجراثيم  التي تساعدك على التخلص من قشرة الرأس. وهذا يضمن فروة الرأس صحية ويعزز نمو الشعر. كما انه يحفز تدفق الدم إلى الجلد، وبالتالي يغذي جذور الشعر. أيضا النيم يستعمل للقضاء على قمل الرأس والصئبان. قومي بغلي أوراق النيم في الماء حتى مستوى المياه ينزل إلى نصف كميته، انتظري الخليط ليبرد. ثم اشطفي شعرك مع الخليط. يمكنك استخدام هذا العلاج ايضا للشطف بعد غسل الشعر بالشامبو.  ينبغي القيام بهذه العملية مرة واحدة كل أسبوع",
    ),
    Recipe(
      id: 'm156',
      category: 'Hair',
      title: 'بذور الحلبة ',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "بذور الكتان هي مصدر غني للأحماض أوميغا 3 الدهنية التي يمكن أن تمنع المزيد من فقدان الشعر وتشجيع نمو الشعر. اشربي ملعقة كبيرة من بذور الكتان المطحون الطازج مع كوب من المياه يوميا في الصباح. يمكنك أيضا إضافة بذور الكتان إلى السلطة والحساء والعصائر، وغيرها من الأطباق الخاصة بك. يمكنك أيضا تطبيق زيت بذور الكتان على شعرك سيساعد على منع تساقط الشعر",
    ),
    Recipe(
      id: 'm157',
      category: 'Hair',
      title: 'بذور الكتان',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "ضعي ثلاث ملاعق كبيرة من بذور الكتان في وعاء من الماء واتركيه لمدة خمسة أيام. بعدها قومي بوضع ماء بذور الكتان على فروة رأسك باستخدام كرة من القطن، واتركيه لمدة عشر دقائق من ثم اغسليه بالماء الدافئ. كرري العملية يوميا لتحصلين على شعر أكثر سمكة في خلال أيام قليلة",
    ),
    Recipe(
      id: 'm158',
      category: 'Hair',
      title: 'بذور الكمون',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "ضعي القليل من الكمون في زيت الزيتون طول الليل، وفي صباح اليوم التالي قومي بتدليك فروة رأسك جيدا مع المزيج، واتركيه لمدة 15 دقيقة من ثم اغسليه",
    ),
    Recipe(
      id: 'm159',
      category: 'Hair',
      title: 'بياض البيض',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "قومي بكسر بيضتان في وعاء وافصلي الصفار من البيض، امزجي بياض البيض جيدا، ثم ضعيه على فروة الرأس والشعر باستخدام فرشاة صبغ الشعر غطي رأسك مع قبعة الدش لمدة حوالي 20 دقيقة، ثم اشطفيه بالماء البارد ثم بشامبو  خفيف. كرري العملية مرتين في الأسبوع",
    ),
    Recipe(
      id: 'm160',
      category: 'Hair',
      title: 'تخفيف التوتر',
      subtitle: ' علاج تساقط الشعر',
      steps:
          "التدليك لفروة الرأس مع زيت مناسب يساعد على تنشيط بصيلات الشعرو يحد من فقدانه ، و يزيد في نموه. يتغلغل الزيت إلى فروة الرأس والتدليك السليم يزيد من تدفق الدم إلى بصيلات الشعر، ويعزز قوة جذور شعرك و يشعرك بالاسترخاء ويقلل  الإحساس بالإجهاد. يمكنك استخدام الزيوت مثل جوز الهند أو زيت اللوز، زيت الزيتون، زيت الخروع وإضافة بضع قطرات من الزيت العطري  إلى الزيت لتحقيق نتائج أفضل وأسرع. هناك أنواع أخرى من الزيوت الفعالة والتي يمكن استخدامها هي زيت الأركان، وزيت جنين القمح. دلكي فروة رأسك بهذه الزيوت عن طريق الضغط الخفيف بأطراف الأصابع كرري هذه العملية مرة واحدة في الأسبوع على الأقل",
    ),
    Recipe(
      id: 'm161',
      category: 'Hair',
      title: 'حليب جوز الهند',
      subtitle: 'علاج تساقط الشعر',
      steps: '''E حليب جوز الهند غني بفيتامين 
فالدهون  تساعد على ترطيب شعرك والحفاظ عليه في حالة صحية جيدة. الحليب غني بالبوتاسيوم وهو عنصر حيوي لنمو الشعر. كما أن لديها خصائص مضادة للجراثيم التي تحمي الشعر من التلف. طبيقي حليب جوز الهند على فروة رأسك باستخدام فرشاة صبغ الشعر ثم قومي بتغطية رأسك بمنشفة واتركيه لمدة حوالي 20 دقيقة، ثم اشطفي شعرك بشامبو خفيف بالماء البارد. يمكنك اتباع هذه العملية مرة واحدة في الأسبوع.- علاج تساقط الشعر''',
    ),
    Recipe(
      id: 'm162',
      category: 'Hair',
      title: 'جذر عرق السوس',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "جذر عرق السوس هو عشب يمنع تساقط الشعر والمزيد من الضرر للشعر. الخصائص المهدئة من جذور عرق السوس تفتح المسام، وتهدئ فروة الرأس. هذا العلاج هو جيد لقشرة الرأس، وفقدان الشعر والصلع. أضيفي ملعقة من جذر عرق السوس لكوب حليب مع ربع ملعقة صغيرة من الزعفران ، ضعي المعجون على البقع الصلعاء في وقت النوم، واتركي الخليط بين ليلة وضحاها و في الصباح، اغسليه جيدا بالشامبو. اتبعي هذا العلاج مرة واحدة أو مرتين في الأسبوع، يمكنك أيضا شرب شاي عرق السوس ثلاث مرات في اليوم",
    ),
    Recipe(
      id: 'm163',
      category: 'Hair',
      title: 'حليب جوز الهند',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "إذا كنتي تريدين فروع شعر صحية وخالية من الأضرار، قومي بتدليك حليب جوز الهند على فروة رأسك واتركيه على شعرك ليلة كاملة، واغسليه بالماء البارد في اليوم التالي",
    ),
    Recipe(
      id: 'm164',
      category: 'Hair',
      title: 'حليب جوز الهند وعصير الليمون',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "أخلطي كوب من حليب جوز الهند وعصير الليمون وضعيه في الثلاجة لبضع ساعات حتى تظهر طبقة دسم على القمة طبّقيها على  فروة رأسك وشعرك ودلكيه جيدا ثم أتركيه لمدة 20 دقيقة، قومي بتغطية شعرك بقبعة دش ولفي منشفة رطبة دافئة حول الغطاء، واتركيه لمدة 30 دقيقة ثم يشطف بالماء والشامبو. قومي بتمشيط شعرك وهو لايزال رطب ويترك حتى يجف",
    ),
    Recipe(
      id: 'm165',
      category: 'Hair',
      title: 'خل التفاح',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "خل التفاح هو عنصر موجود في مطبخنا، وهو أمر مفيد في كل شيء تقريبا. الخل فعال في إزالة قشرة الرأس والتخلص من الشعر الدهني وإضافة اللمعان. اخلطي ربع كوب من خل التفاح العادي مع كوب من الماء. قومي بتدليك فروة الرأس مع هذا الحل لمدة دقيقتين ثم شطف الشعر بالشامبو. كرري هذا العلاج مرتين في الأسبوع للقضاء على القشرة تماما والتخلص من الشعر الدهني",
    ),
    Recipe(
      id: 'm166',
      category: 'Hair',
      title: 'زهرة الكركديه',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "زهرة الكركديه لديها العديد من الخصائص الطبيعية التي يمكن أن تساعد في علاج تساقط الشعر. بالإضافة إلى تعزيز نمو الشعر، ويمكن أيضا لهذه الزهرة أن تستخدم لعلاج قشرة الرأس، ومنع التقصف، وعلاج الشيب المبكر. أضيفي 10 من زهور الكركديه إلى كوبين من زيت جوز الهند الدافئ، طبيقي الزيت على شعرك قبل الذهاب إلى النوم. ثم إغسلي شعرك في الصباح. كرري هذه العملية عدة مرات في الأسبوع. يمكنك أيضا شرب شاي زهرة الكركديه واستخدامها لشطف شعرك لتشجيع النمو السليم",
    ),
    Recipe(
      id: 'm167',
      category: 'Hair',
      title: 'زهرة الكركديه',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "زهرة الكركديه تعتبر زهرة العناية بالشعر فهي تساعد في علاج  قشرة الرأس، وكذلك تكثيف وتطويل الشعر. قومي بعمل عجينة من زهرة الكركديه مع زيت جوز الهند أو زيت السمسم، وضعيها على فروع شعرك وأتركيها لبعض الوقت، من ثم اشطفيها جيداً",
    ),
    Recipe(
      id: 'm168',
      category: 'Hair',
      title: 'زيت إكليل الجبل',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "إكليل الجبل ممتاز جدا في التعامل مع مشاكل الشعر. كما أنه يساعد على نمو وتطويل  الشعر وتقوية جذوره ويزيل قشرة الرأس. زيت إكليل الجبل له خصائص مضادة للأكسدة التي تعزز نمو الشعر. وبالإضافة إلى ذلك، محتواه من الكبريت والسيليكا يساعدانه في تقوية الشعر وتطويله وتكثيفه. زيت إكليل الجبل يساعد في زيادة تدفق الدم إلى فروة الرأس وتنشيط بصيلات الشعر. كل ما عليك القيام به هو خلط قطرتين من زيت إكليل الجبل مع ملعقتين من واحد من هذه الزيوت مثل زيت الزيتون وزيت جوز الهند وزيت الجوجوبا وزيت اللوز أو زيت الأفوكادو. طبقي هذه الزيوت على شعرك مع التدليك في حركات دائرية على فروة الرأس. ثم تركه لمدة نصف ساعة على الأقل بعد ذلك يمكنك شطف الشعر بالشامبو كالمعتاد",
    ),
    Recipe(
      id: 'm169',
      category: 'Hair',
      title: 'زيت إكليل الجبل',
      subtitle: ' علاج تساقط الشعر',
      steps:
          "زيت روزماري يتم استخراجه من أوراق إكليل الجبل، ويستخدم لمنع تساقط الشعر حتى بالنسبة لداء الثعلبة، كذلك يحفز جذور الشعر ويزيد الدورة الدموية في فروة الرأس مما يؤدي إلى نمو الشعر. أيضا يمكنك مزج زيت الجوجوبا، زيت بذور العنب، زيت اللوز مع زيت إكليل الجبل وتدليك فروة الرأس يوميا أو أسبوعيا حسب حالة فقدان الشعر",
    ),
    Recipe(
      id: 'm170',
      category: 'Hair',
      title: 'زيت الخزامى',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "زيت الخزامى هو مفيد لمنع تساقط الشعر بسبب العناصر الغذائية المضادة للأكسدة. هذا الزيت مستمدة من زهور اللافندر يمكنه منع تساقط الشعر والقشرة وكذلك الحكة والتقليل من تكسر الشعر، كذلك يستخدم زيت اللافندر على نطاق واسع لعلاج داء الثعلبة. في مثل هذه الحالات القصوى يجب التدليك اليومي مع زيت اللافندر",
    ),
    Recipe(
      id: 'm171',
      category: 'Hair',
      title: 'زيت الزيتون',
      subtitle: 'علاج تساقط الشعر',
      steps:
          ''' E زيت الزيتون غني بالمواد المضادة للأكسدة وهو يساهم في توفير التغذية المثالية لشعرك مما يجعله فعال في علاج تساقط الشعر بسبب احتوائه على فيتامين 
          والأحماض الدهنية التي تساعد في نمو الشعر أيضا
         ''',
    ),
    Recipe(
      id: 'm172',
      category: 'Hair',
      title: 'زيت الزيتون والألوة فيرا ',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "أخطي نصف كوب من جل الألوة فيرا وزيت الزيتون الدافئ (اختياريا) يمكنك إضافة ست قطرات من زيت إكليل الجبل وزيت خشب الصندل. دلكي الخليط على شعرك وفروة رأسك ثم غطيه بقبعة دش لمدة 1-2 ساعات قبل غسله",
    ),
    Recipe(
      id: 'm173',
      category: 'Hair',
      title: 'زيت الزيتون والعسل',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "امزجي زيت الزيتون مع العسل حسب طول الشعر ثم طبقيه على شعرك واغسليه بعد نصف ساعة لتستمتعي بشعر كثيف وناعم. طريقة أخرى بسيطة، قومي بتدليك زيت الزيتون على شعرك وفروة رأسك بأطراف أصابعك واتركيه ليلة كاملة، ثم اغسليه في الصباح التالي",
    ),
    Recipe(
      id: 'm174',
      category: 'Hair',
      title: 'زيت اللوز',
      subtitle: 'علاج تساقط الشعر',
      steps:
          ''' D E زيت اللوز من أكثر الزيوت المغذية وذلك لمحتوياته الغنية والتي تشمل الفيتامينات 
الحديد، المغنيسيوم، والكالسيوم، والدهون. يمكن إستخدام زيت اللوز عند تطبيق الزيوت الأساسية على فروة رأسك مع التدليك، فهو يمتص ببطء وبعمق في الشعر مما يجعله مثالي
''',
    ),
    Recipe(
      id: 'm175',
      category: 'Hair',
      title: 'زيت جوز الهند',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "دلكي زيت جوز الهند الدافئ على فروة رأسك بأطراف أصابعك في حركة دائرية بدون ضغط. قومي بتغطية رأسك بمنشفة ساخنه واتركيها لمدة نصف ساعة، بعدها اغسليه بالشامبو. كرّري الطريقة مرة على الأقل في الأسبوع لتتمتعي بشعر كثيف وطويل",
    ),
    Recipe(
      id: 'm176',
      category: 'Hair',
      title: 'زيت روزماري ',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "زيت إكليل الجبل يحفز جذور الشعر ويزيد الدورة الدموية في فروة الرأس مما يؤدي إلى نمو الشعر. يمكن مزجه مع  زيت الجوجوبا، وزيت بذور العنب أو زيت اللوز ودلكي به فروة رأسك يوميا أو أسبوعيا حسب الحالة",
    ),
    Recipe(
      id: 'm177',
      category: 'Hair',
      title: 'E زيت فيتامين',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "امزجي ملعقتين من العسل وعصير الليمون جيدا ثم اضيفي إليها صفار بيضة واربع ملاعق كبيرة من زيت الزيتون أو اللوز (يمكن تغير المقادير حسب طول الشعر). أخلطي المكونات جيدا، وطبّقيها على شعرك من الجذور إلى الأطراف. غطي راسك بمنشفة أو غطاء من البلاستيك لمدة ساعة، ثم يغسل بالماء البارد ويمكن  استخدام الشامبو للشعر الدهني",
    ),
    Recipe(
      id: 'm178',
      category: 'Hair',
      title: 'صفار البيض وعصير الليمون',
      subtitle: 'علاج الشعر الدهني',
      steps:
          "علاج آخر للتخلص من الشعر الدهني ولإزالة التشحم الزائد. صفار البيض ليس فقط يزيل الزيت الزائد ولكن أيضا يضفي لمعانا على الشعر. لهذا، امزجي اثنين من صفار البيض وإضافات إليه بضع قطرات من عصير الليمون. ثم ضعي الخليط على الشعر الرطب ويترك لمدة 5-7 دقائق. بعد ذلك، اشطفيه جيدا. استخدام هذا الخليط على الأقل مرتين أو ثلاث مرات في الأسبوع",
    ),
    Recipe(
      id: 'm179',
      category: 'Hair',
      title: 'عرق السوس',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "أخلطي ملعقتين كبيرة من مسحوق عرق السوس مع اربع ملاعق حليب واضيفي إليها رشة من الزعفران. طبيقي الخليط على بقع صلعاء أو المناطق الخفيفه واتركيه بين عشية وضحاها واشطفيه في الصباح التالي. هذه العلاج مدهشة في تسريع نمو الشعر وتكثيفه في خلال شهر",
    ),
    Recipe(
      id: 'm180',
      category: 'Hair',
      title: 'عصير البصل',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "عصير البصل يساعد في علاج تساقط الشعر بسبب محتواه العالي من الكبريت، مما يساعد في تحسين الدورة الدموية لبصيلات الشعر وتجديدها وتقليل الالتهاب.الخصائص المضادة للجراثيم في عصير البصل تساعد في قتل الجراثيم والطفيليات، وعلاج التهابات فروة الرأس التي يمكن أن تسبب فقدان الشعر. قومي بإستخراج عصير البصل ثم   طبيقيه مباشرة على فروة رأسك، اتركيه لمدة 30 دقيقة ثم اغسليه بالشامبو. بدلا من ذلك امزجي معا ثلاث ملاعق من عصير البصل وملعقتين من هلام الصبار. يمكنك أيضا إضافة ملعقة من زيت الزيتون، طبيقي هذا الخليط على فروة رأسك واتركيه لمدة 30 دقيقة على الأقل قبل شطف شعرك بالشامبو. كرري هذه العلاجات مرتين أو ثلاث مرات في الأسبوع لمدة عدة أسابيع",
    ),
    Recipe(
      id: 'm181',
      category: 'Hair',
      title: 'عصير البصل',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "عصير البصل هو واحد من أفضل وأقدم العلاجات لتطويل وتكثيف الشعر. فهو يحتوي على الكبريت الذي يساعد في تعزيز نمو الشعر. استخرجي عصير البصل أو الكراث الحمراء، وضعيه على شعرك لمدة خمس عشرة دقيقة، وبعدها قومي بشطفه مع شامبو معتدل",
    ),
    Recipe(
      id: 'm182',
      category: 'Hair',
      title: 'عصير البطاطس',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "اذا كنتي تعانين من 'داء الثعلبة' (وهي حالة من ترقق الشعر) فهذه الوصفه هي الأمثال لكي. ببساطة قومي باستخراج عصير البطاطس وضعيه على فروة رأسك، واتركيه لمدة 15-20 دقيقة، من ثم اغسليه",
    ),
    Recipe(
      id: 'm183',
      category: 'Hair',
      title: 'عصير الشمندر',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          ''' B و C الشمندر من الخضار الغنية بالبروتين، والكاروتينات والفيتامينات
والكالسيوم والحديد والمغنيسيوم والبوتاسيوم والفوسفور والسيليكا. لتسهيل نمو وتكثيف الشعر، يمكنك شرب عصير الشمندر بانتظام. أو بدلا من ذلك  يمكنك دمجه مع عصير الخضروات مثل الخيار والجزر والكزبرة والخس، أو غيرها
''',
    ),
    Recipe(
      id: 'm184',
      category: 'Hair',
      title: 'عصير الكزبرة',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الكزبرة تساعد في تنعيم وعلاج تساقط الشعر وفعالة في تعزيز نموه. اطحني أوراق الكزبرة وامزجيها مع الماء للحصول على عجينة. قومي بتطبيقها على فروة رأسك والشعر، واتركيها لمدة ساعة، ثم تشطف بالشامبو كالمعتاد في الصباح قبل الاستحمام. يمكنك تكرار هذه العملية مرتين أو ثلاث مرات في الأسبوع",
    ),
    Recipe(
      id: 'm185',
      category: 'Hair',
      title: 'عصير الليمون',
      subtitle: 'علاج تساقط الشعر',
      steps:
          "الليمون هو من  الأدوية القابضة الممتازة في تشديد المسام في فروة الرأس، وبالتالي يسيطر على تساقط الشعر. إذا كان لديك شعر دهني، اشطفي شعرك بعصير الليمون. كما يحتوي الليمون أيضا على أحماض ألفا هيدروكسي لتقشير الخلايا الميتة، والقضاء على القشرة، وهو غني بفيتامين (ج)، وهي من المغذيات الأساسية التي تساعد على الحفاظ على صحة الشعر. بعد غسل شعرك في الحمام، صبي بلطف عصير الليمون على فروة رأسك مع تدليك فروة الرأس في نفس الوقت، واتركيه على شعرك لمدة خمس دقائق، ثم اغسليه بالماء البارد، كريري العملية مرة واحدة أو مرتين في الأسبوع. إحذري على الرغم من كونه آمن فالليمون يحتوي على الأحماض وبالتالي، اغمضي عينيك عند تطبيقه فوق رأسك، أيضا تذكري عدم ترك عصير الليمون  لمدة طويلة كي لا يجف شعرك",
    ),
    Recipe(
      id: 'm186',
      category: 'Hair',
      title: 'عصير الليمون وزيت',
      subtitle: 'علاج الشيب',
      steps:
          "أخلطي ملعقتين كبيرة من زيت اللوز مع ثلاث ملاعق كبيرة من عصير الليمون في وعاء زجاجي. طبيقي الخليط على فروة رأسك وشعرك، واتركيه لمدة 30 دقيقة ثم اغسليه بالشامبو خفيف. يعمل عصير الليمون وزيت اللوز كعلاج لقشرة الشعر والتقصف والشيب",
    ),
    Recipe(
      id: '187',
      category: 'Hair',
      title: 'عنب الثعلب',
      subtitle: 'تكثيف الشعر الخفيف',
      steps:
          "ضعي ملعقة كبيرة من عنب الثعلب المجففة مع ملعقتين من زيت جوز الهند على نار لبعض الوقت، ثم قومي بتصفيته بعد أن يبرد. دلكي الزيت على فروة رأسك لبعض الدقائق واتركيه ليلة كاملة، ثم اغسليه بالشامبو في الصباح التالي. كرّري العلاج أربع مرات في الأسبوع لرؤية النتائج",
    ),
    Recipe(
      id: 'm188',
      category: 'Hair',
      title: 'عنب الثعلب أو أملا (أملج شائع)',
      subtitle: 'علاج تساقط الشعر',
      steps: ''' C عنب الثعلب الهندي هو مصدر غني بالفيتامين
والحديد ما يجعله رائع في علاج سقوط الشعر 
غلي عنب الثعلب المجفف في زيت جوز الهند حتى يتغير لونه إلى أسود، و يترك ليبرد ثم يصفى، ويدلك الزيت على فروة رأس.
''',
    ),
    Recipe(
      id: 'm189',
      category: 'Hair',
      title: 'عنب الثعلب الهندي (أملا)',
      subtitle: 'تطويل وتكثيف الشعر',
      steps: ''' C أملا هي قوة محركة للفيتامين 
ومضادات الأكسدة، عنب الثعلب الهندي يعزز كثافة وطول الشعر. يمكنك استخدامه على شكل مسحوق أو عصير. أخلطي أي من الاثنين مع عصير الليمون، وضعي المزيج على فروة رأسك، واشطفيه بالماء الدافئ بعد ساعة
''',
    ),
    Recipe(
      id: 'm190',
      category: 'Hair',
      title: 'قناع البيض للشعر',
      subtitle: 'تطويل وتكثيف الشعر',
      steps:
          "الخصائص العلاجية في البيض تعمل بشكل جيد لتطويل وتكثيف الشعر، وهو يحتوي على مستويات عالية من البروتينات والزنك والكبريت والحديد والفوسفور واليود، مما يجعل هذا القناع أكثر من المدهش للشعر. بكل بساطة ضعي بياض بيضتين على شعرك، واتركيه لمدة 15 دقيقة. كرري هذا القناع بشكل منتظم للحصول على شعر أكثر لمعانًا وتألقًا",
    ),
    Recipe(
      id: 'm191',
      category: 'Hair',
      title: 'قناع البيض والموز',
      subtitle: 'تنعيم الشعر الخشن',
      steps:
          "أخلطي بياض بيضة مع موزة مهروسة و ملعقتين صغيرة من العسل وزيت الزيتون. طبيقي الخليط على شعرك وقومي بتمشيطه جيدا ويلف لمدة ساعة، ثم يشطف. ستلاحظين النتائج المذهلة بعد أن يجف",
    ),
    Recipe(
      id: 'm192',
      category: 'Hair',
      title: 'قناع عنب الثعلب الهندي والحلبة ',
      subtitle: 'علاج الشيب المبكر',
      steps:
          "إغلي 5-6 من عنب الثعلب الهندي مجفف في نصف كأس من زيت جوز الهند لمدة 5 إلى 6 دقائق، من ثم أضيفي إليه ملعقة كبيرة من مسحوق بذور الحلبة المطحونة واتركيه لمدة دقيقة إضافية. طبّقي المزيج على فروة رأسك وشعرك قبل النوم واغسليه في اليوم التالي بالشامبو خفيف. يساعد مزيج الثعلب الهندي والحلبة في تغذية الشعر وعلاج الشيب",
    ),
    Recipe(
      id: 'm193',
      category: 'Hair',
      title: 'عصيرل',
      subtitle: 'تطويل',
      steps:
          "عصير البصل هو واحد من أفضل وأقدم العلاجات لتطويل وتكثيف الشعر. فهو يحتوي على الكبريت الذي يساعد في تعزيز نمو الشعر. استخرجي عصير البصل أو الكراث الحمراء، وضعيه على شعرك لمدة خمس عشرة دقيقة، وبعدها قومي بشطفه مع شامبو معتدل",
    ),
    Recipe(
      id: 'm194',
      category: 'Hair',
      title: 'هلام الألوة فيرا وعصير الليمون',
      subtitle: 'علاج الشعر الدهني',
      steps:
          "هلام الألوة فيرا واحد من أفضل العلاجات الطبيعية للشعر الدهني. كل ما عليك القيام به هو أخذ كوب من شامبو معتدل وإضافة ملعقة كبيرة من عصير الليمون وملعقة صغيرة من هلام الألوة فيرا إليه. يمكنك وضع هذا المزيج في زجاجة وتخزينه في الثلاجة. يجب غسل الشعر بالشامبو كل يوم مع هذا الخليط للتخلص من الشعر الدهني. بدلا من ذلك يمكنك أيضا صنع مكيف للشعر باستخدام هلام الصبار مع ملعقة من خل التفاح أو 2 ملاعق كبيرة من عصير الليمون. هذا القناع يزيد من كثافة الشعر ويقلل من الزيت على الشعر",
    ),
    Recipe(
      id: 'm195',
      category: 'Face',
      title: 'الكركم',
      subtitle: 'تبييض الوجه',
      steps:
          "ضعي ملعقتين من الحليب ونصف ملعقة من عصير الليمون ونصف ملعقة من الكركم وملعقتين من طحين الحمص في وعاء. أخلطي جميع المكونات جيدا وضعيها على وجهك لمدة 15 دقيقة قبل غسله بالماء",
    ),
    Recipe(
      id: 'm196',
      category: 'Face',
      title: 'عصير الطماطم',
      subtitle: 'تنظيف البشرة',
      steps:
          "يعمل عصير الطماطم كعامل تبييض طبيعي ويعمل على تخليص الوجه من علامات غير المرغوب فيها والعيوب، الطماطم هي مصدر غني بالمواد المضادة للتأكسد وتساعد في الحفاظ على شباب البشرة، إصنعيعجينة من الطماطم مع ماء الورد وطبقيها على البقع السوداء لمدة 10 دقائق، واتركيها لمدة 10 دقائق أخرى ثم اغسليه بالماء، الطماطم تساعد أيضا في تحسين لون البشرة إلى جانب إزالة البقع الداكنة",
    ),
    Recipe(
      id: 'm197',
      category: 'Face',
      title: 'أوراق النعناع',
      subtitle: 'تبييض الوجه',
      steps:
          "ضعي أوراق النعناع كقناع على وجهك لمدة 15 دقيقة، بعدها قومي بغسله. النعناع سوف يساعد في تنظيف مسام الجلد وإزالة حروق الشمس وتبيض الوجه",
    ),
    Recipe(
      id: 'm198',
      category: 'Face',
      title: 'الألوة فيرا',
      subtitle: 'تنظيف البشرة',
      steps:
          "يستخدم الصبار لعلاج الأمراض على نطاق واسع في جميع أنحاء العالم، هذا هو واحد من أفضل العلاجات الطبيعية للبشرة،  يحتوي أيضا على خصائص مضادة للجراثيم التي تساعد على قتل البكتيريا التي تسبب حب الشباب، والمضادة للالتهابات والخصائص التي تساعد في تهدئة البشرة المتهيجة، ولديه خصائص مضادة تساعد في التخلص من العيوب والاحمرار بالاضافة الى ذلك، الصبار يرطب البشرة ويحفز نمو خلايا البشره الجديدة، استخرجى هلام الألوة فيرا،  و طبقيه على وجهك باستخدام القطن، واتركيه حتى يجف، ثم اشطفيه مع الماء الفاتر، اتبعي هذه الطريقة يوميا أوعدة مرات في الأسبوع",
    ),
    Recipe(
      id: 'm199',
      category: 'Face',
      title: 'البابايا',
      subtitle: 'تنظيف البشرة',
      steps:
          "يستخدم البابايا لتحسين نسيج والحفاظ على نضارة البشرة وجمالها،  يحتوي على خصائص التبييض الطبيعية التي تساعد على الحد من ظهور الندبات، بالاضافة الى ذلك، الانزيم غراء موجودة في البابايا مضاد للجراثيم ويساعد في إزالة الخلايا الميته، وتلف الجلد أيضا، قومي بتقطيع البابايا إلى قطع صغيرة، ثم اخلطي  البابايا مع ملعقة من مسحوق خشب الصندل  والعسل، امزجي جميع المكونات لتشكيل عجينة، ضعي الخليط على وجهك والرقبة، واتركيه لمدة نصف ساعة، ثم اشطفيه مع الماء البارد، واتركي البشرة  حتى تجف، اتبعي هذا العلاج مرة واحدة في الأسبوع وستلاحظين وجود تغيير واضح في لون بشرتك",
    ),
    Recipe(
      id: 'm200',
      category: 'Face',
      title: 'البابايا والعسل ',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي كوباً من لبّ البابايا وملعقة صغير من العسل. طبّقي الخليط على وجهك لمدة 20 دقيقة، من ثم اغسليه. يساعد هذا الخليط في تبيض الوجه وازالة البقع ويعمل كواقي من الشمس.",
    ),
    Recipe(
      id: 'm201',
      category: 'Face',
      title: 'البرتقال والمانجو والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "هذه المكونات تغذي وكذلك تنظيف البشرة بشكل فعال. يتم خلط حوالي نصف كوب من السكر مع نصف كوب من زيت جوز الهند، وملعقتين كبيرة من عصير البرتقال الطازج وربع كوب من المانجو المهروس.وخلط المكونات جيدا وتطبيقها على الجلد. هذا خليط يعطي ناعمة وتوهجة للبشرة",
    ),
    Recipe(
      id: 'm202',
      category: 'Face',
      title: 'البطاطس',
      subtitle: 'تبييض الوجه',
      steps: ''' C البطاطا عامل طبيعي لتبييض البشرة وهي غنية بالفيتامين
الذي يساعد في الحفاظ على صحة البشرة. ضعي البطاطس المبشور على وجهك واشطفيه بعد 30 دقيقة، كرّري العمليه على أساس منتظم
خلطة أخرى رائعة : امزجي كل من عصير البطاطس والليمون، وضعيه على بشرتك
''',
    ),
    Recipe(
      id: 'm203',
      category: 'Face',
      title: 'التفاح',
      subtitle: 'البشرة الدهنية',
      steps:
          "أخلطي نصف كوب من التفاح المهروس والشوفان المطبوخ مع بياض بيضة وملعقة كبيرة من عصير الليمون، طبّقي الخلطة على وجهك واتركيها لمدة 15 - 20 دقيقة حتى تجف، ثم تغسل بالماء البارد. استخدمي الطريقة بانتظام لتلاحظى الفرق. طريقة أخرى بسيطة امزجي 4 ملاعق كبيرة من العسل مع تفاحة مهروسة وطبّقيها على وجهك لمدة 15 - 20 دقيقة، ثم أزيليها بالماء البارد",
    ),
    Recipe(
      id: 'm204',
      category: 'Face',
      title: 'الجوز',
      subtitle: 'تنظيف البشرة',
      steps:
          "الجوزيحتوي على مضادات الأكسدة التي تساعد في إصلاح خلايا الجلد وتعزيز اشعاعا البشره، يمكن استخدامه لتقشير البشرة وإزالة الشوائب والأوساخ، اخلطي ملعقتين من الجوز مع ملعقتين من الزبادي لتكوين عجينة، ضعي العجينة على وجهك والرقبة، عندما يجف الخليط قومي بفركه في جميع أنحاء وجهك ثم اشطفيه مع الماء الفاتر، إستخدمي هذا القناع مرة واحدة في الأسبوع. بدلا من ذلك، انقعي ثلاث جوزات في الماء طوال الليل،  في اليوم التالي امزجي مقدار ملعقة من ماء الورد مع الجوز لتكوين عجينة، ضعي المعجون على وجهك،  لمدة ساعة، ثم اشطفيه بالماء الفاتر، اتبعي هذا العلاج مرة واحدة في الأسبوع. يمكنك أيضا تناول اثنين أو ثلاثة من الجوز مع كوب من الحليب كل صباح",
    ),
    Recipe(
      id: 'm205',
      category: 'Face',
      title: 'الحليب',
      subtitle: 'البشرة الدهنية',
      steps:
          "امزجي ملعقتين من الحليب وثلاث قطرات من زيت اللافندر أو خشب الصندل. طبيقي المزيج على وجهك قبل النوم باستخدام قطعة من القطن، ثم اغسليه بشكل كامل لإزالة أثار المكياج. طريقة أخرى رائعة ضعي مكعبات من الثلج في وعاء ملئ بالحليب ثم افركيها على وجهك وكرّري العملية لمدة 5 - 10 دقائق لتحقيق نتائج مذهلة",
    ),
    Recipe(
      id: 'm206',
      category: 'Face',
      title: 'الحليب والعسل',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي ملعقة من اللبن أو الحليب المجفف مع ملعقة من العسل. من ثم إدهني الخليط على وجهك (نظيف) واتركيه لمدة 15 دقيقة قبل شطفه",
    ),
    Recipe(
      id: 'm207',
      category: 'Face',
      title: 'الخل',
      subtitle: 'البشرة الدهنية',
      steps:
          "اغمسي قطعة من القطن في الخل وطبّقيها على وجهك قبل الذهب إلى نوم واتركيه لمدة 5 - 10 دقائق، ثم يغسل بالماء البارد. في الصيف، يمكنك تجميد الخل إلى مكعبات ووضعها على وجهك",
    ),
    Recipe(
      id: 'm208',
      category: 'Face',
      title: 'الخيار',
      subtitle: 'تنظيف البشرة',
      steps:
          "الخيار يرطب ويغذي البشرة  ويساعد في  تحسين المظهر العام لبشرتك عن طريق إصلاح خلايا الجلد التالفة، وإزالة خلايا الجلد الميتة وإضافة التوهج، قومي بتقطيع الخيار الطازج إلى شرائح، وافركيه على كامل الوجه، واتركيه بين ليلة وضحاها واشطفيه بالماء الدافئ في الصباح اليوم التالي، كرّري العملية يوميا قبل الذهاب إلى الفراش. بدلا من ذلك، امزجي كمية متساوية من عصير الخيار وعصير الليمون، طبقي المزيج على بشرتك، واتركيه حتى يجف تماما، ثم اغسليه بالماء الدافئ يوميا",
    ),
    Recipe(
      id: 'm209',
      category: 'Face',
      title: 'الزبادي',
      subtitle: 'تبييض الوجه',
      steps:
          "الزبادي تحتوي على خصائص التفتيح الطبيعي للبشرة. قومي بتطبيق الزبادي مباشرة على البشرة وذلك سيساعد في تلاشى الندوب وعلاج العديد من مشاكل البشرة. يمكنك أيضا خلط ملعقة كبيرة من الزبادي مع 8-9 قطرات من عصير الليمون الطازج، وقطرات صغيرة من ماء الورد، أو الخزامى أو زيت زهرة الياسمين. امزجي هذا الخليط جيدا ثم طبقي هذا القناع على كامل وجهك والرقبة بعد ذلك يمكنك غسله بالماء الفاتر بعد 40 دقيقة",
    ),
    Recipe(
      id: 'm210',
      category: 'Face',
      title: 'الزبادي وطحين الشوفان',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي ملعقة من الزبادي وملعقة من عصير الطماطم مع ملعقة من طحين الشوفان. ضعي الخليط على وجهك واتركيه حتى يجف لمدة 15 إلى 20 دقيقة، من ثم قومي بغسله عن طريق الفرك لإزالة الجلد الميت",
    ),
    Recipe(
      id: '211',
      category: 'Face',
      title: 'الزعفران والحليب',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي ملعقة كل من الزعفران والحليب الخام، وقومي بتدليك وجهك بحركات دائرية لمدة دقيقتين من ثم أتركيه ليجف لمدة 15 دقيقة قبل غسله. هذه الخلطة ممتازة لتبيض الوجه وعلاج البشرة الجافة",
    ),
    Recipe(
      id: 'm212',
      category: 'Face',
      title: 'السكر البني مع العسل',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "السكر البني هو أفضل مقشر طبيعي للبشرة. خلط نصف كوب عسل مع نصف كوب من السكر البني وملعقة كبيرة من زيت الزيتون أو جوز الهند. ضعها على البشرة وفرك في حركة دائرية. يغسل بالماء الفاتر",
    ),
    Recipe(
      id: 'm213',
      category: 'Face',
      title: 'السكر والبطاطا لتنظيف البشرة',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "اخذ كوبين من السكر و ملعقتين طعام من عصير البطاطا، مع ملعقتين طعام من كريم الحليب. خلط المكونات جيدا. وضع الخليط على البشرة وفرك بحركة دائرية لإزالة البقع الداكنة",
    ),
    Recipe(
      id: 'm214',
      category: 'Face',
      title: 'السكر وعصير النعناع',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "نصف كوب من حبيبات السكر مختلطة مع ملعقة صغيرة من عصير النعناع وملعقة صغيرة من زيت اللوز و قطرة من زيت النعناع. بعض استخدام هذا المزيج تصبح البشرة أكثر انتعاش وإشراق",
    ),
    Recipe(
      id: '215',
      category: 'Face',
      title: 'الشوفان مع الألوة فيرا ',
      subtitle: 'البشرة الدهنية',
      steps:
          "الصبار والشوفان رائعين معا في علاج البشرة الدهنية. أخلطي ملعقة كبيرة من دقيق الشوفان مع جل الألوفيرا ثم افركيها بلطف على وجهك وأتركيها لمدة 15 دقيقة، ثم أزيليها بالماء. ملاحظة تجنبي الفرك إن كنت تعانين من حب الشباب وأعراضه",
    ),
    Recipe(
      id: 'm216',
      category: 'Face',
      title: 'الطماطم (البندورة)',
      subtitle: 'تبييض الوجه',
      steps:
          "تعتبر الطماطم (البندورة) على أنها من الخضروات، ولكنها في حقيقة الأمر من الفواكه الحمضية. يمكن خلط الطماطم مع غيرها من المكونات مثل معجون البابايا النيئة أو  كل من هذه المكونات مثل الزبادي أو الحليب الذين يمكن أن يحيد بعض من الحامض. هذه الوصفة تعمل لتبييض السريع للوجه",
    ),
    Recipe(
      id: 'm217',
      category: 'Face',
      title: 'الطماطم ',
      subtitle: 'البشرة الدهنية',
      steps:
          "اغمسي قطعة من القطن في عصير الطماطم وضعيه على وجهك حتى يجف، ثم اغسليه. استخدمي الطريقة مرة أو مرتين في الأسبوع لتحصلي على نتائج رائعة",
    ),
    Recipe(
      id: 'm218',
      category: 'Face',
      title: 'الفراولة ',
      subtitle: 'hhhhhhhhhh',
      steps: ''' C الفراولة غنية بالمواد  المضادة للتأكسد مثل فيتامين
      ويمكن استخدامها كقناع للوجه لإزالة العلامات والبقع بشكل طبيعي، اعجني القليل من الفراولة ومزجها مع ملعقتين من زبادي، امزجي الخليط جيدا وطبيقه على وجهك والرقبة، واتركيه لمدة 20 دقيقة ثم غسله بالماء، وجود الأحماض الدهنية أوميغا 3 وحمض الصفصاف في الفراولة يجعلها علاجا رائعا للبثور
      ''',
    ),
    Recipe(
      id: 'm219',
      category: 'Face',
      title: 'الفراولة والعسل',
      subtitle: 'تبييض الوجه',
      steps:
          "اهرسي بعض من حبة الفراولة واضيفي إليها القليل من الحليب والعسل. طبّقي القناع على وجهك واتركيه لمدة 20 دقيقة، من ثم اغسليه بالماء البارد. هذا القناع يناسب جميع الفئات العمرية",
    ),
    Recipe(
      id: 'm220',
      category: 'Face',
      title: 'لكركم',
      subtitle: 'تنظيف البشرة',
      steps:
          "الكركم هو مطهر ممتاز ويساعد على تقليل من الندوب والعلامات الأخرى، بالإضافة إلى ذلك، يمكن للكركم أن يخفف اضطرابات حساسية البشره والتهابات. اخلطي الكركم مع الماء لتشكيل عجينة، ثم ضعيه على وجهك، واتركيه لمدة 5 دقائق واغسليه بالماء البارد. الكركم هو آمن لجميع أنواع البشرة، يمكنك ان ترى الفرق في بشرتك في غضون أسابيع قليلةبدلا من ذلك، امزجي ملعقة واحدة من مسحوق الكركم مع ما يكفي من عصير الأناناس لتكوين عجينة، طبقي العجينه على الوجه والرقبة، واتركيها إلى أن تجف تماما، ثم اغسليه بالماء الفاتر، اتبعي هذا العلاج مرتين أو ثلاث مرات في الأسبوع للحد من ظهور بقع على الجلد. خيار آخر، اخلطي كميات متساوية من مسحوق الكركم والطحين مع قليل من الماء أو الحليب، وضعي الخليط على بشرتك واتركيه حتى يجف، وغسله بماء فاتر، ثم قومي بتنقية بشرتك بلطف في حركة دائرية،  اتبعي هذا العلاج مرة واحدة في الأسبوع لتفتيح لون بشرتك وإزالة الندوب ",
    ),
    Recipe(
      id: 'm221',
      category: 'Face',
      title: 'اللوز والسكر',
      subtitle: 'قشير وتنظيف الوجه',
      steps:
          "طريقة أخرى مدهشه آخر لتقشير وتنظيف البشرة. مزج نصف كوب سكر مع نصف ملعقة كبيرة من لاللوز المطحون. خلط ملعقة من عسل وملعقتين من زيت جوز الهند وعصير الليمون. مزج المكونات جيد، وضعها على الجلد للحصول على بشرة جميلة ونظيفة",
    ),
    Recipe(
      id: 'm222',
      category: 'Face',
      title: 'الليمون والبرتقال والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "مزيج 3 أكواب من السكر ونصف كوب من زيت الزيتون مع ملعقة كبيرة من مسحوق قشر البرتقال. وهي طريقة  فعالة للحصول على بشرة نظيفة وناعمة ومتوهجة",
    ),
    Recipe(
      id: 'm223',
      category: 'Face',
      title: 'الليمون والعسل والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "مزج كوب من السكر مع ملعقة طعام من عصير الليمون وملعقة صغيرة من العسل ويطبق على البشرة. الليمون يحتوي على  خصائص التطهير والعسل له خصائص الترطيب لترك البشرة مشرقة وناعمة",
    ),
    Recipe(
      id: 'n224',
      category: 'Face',
      title: 'الملح',
      subtitle: 'البشرة الدهنية',
      steps:
          "ضعي ملعقة صغيرة من الملح في زجاجة رذاذ مملوءة بالماء الفاتر، أغلقي عينيك ورشي وجهك واتركيه بدون أن تغسليه. كرّري العملية بانتظام مرة في اليوم حتى تتخلصي نهائيا من البشرة الدهنية",
    ),
    Recipe(
      id: 'm225',
      category: 'Face',
      title: 'الموز',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي موزة مهروسة مع ملعقة كبيرة من الزبادي والعسل. طبّقي الخليط على وجهك لمدة 15 دقيقة من ثم اغسليه. تساعد هذه الخلطة على تبيض البشرة وعلاج حروق الشمس",
    ),
    Recipe(
      id: 'm226',
      category: 'Face',
      title: 'الموز والعسل',
      subtitle: 'البشرة الدهنية',
      steps:
          "ضعي ملعقة كبيرة من العسل مع شرائح من الموز وبضع قطرات من الليمون أو عصير البرتقال في الخلاط. الآن، طبيقي الخلطة على وجهك واتركيها لمدة 15 دقيقة، ثم أزيليها بقطعة قماش مغسولة واتركيه حتى يجف ثم طبيقي العسل كقناع على وجهك",
    ),
    Recipe(
      id: 'm227',
      category: 'Face',
      title: 'النعناع',
      subtitle: 'تنظيف البشرة',
      steps:
          "أوراق النعناع ممتازة لإزالة بقع حب الشباب كما أنها تساعد في إزالة الهالات السوداء، امزجي أوراق النعناع في الخلاط، وضعيه على المنطقة المصابة، لمدة 5 دقائق واغسليه بالماء، إستخدمي هذا العلاج  ثلاث مرات في الأسبوع للحصول على أفضل النتائج، ضعي ملعقة من مسحوق النعناع وملعقة من كل من زبادي و قصارالأرض في وعاء، واتركيه لمدة نصف ساعة، ثم اخلطيه جيدا للحصول على عجينة، ثم طبيقى هذاالخليط على وجهك والرقبة، واتركيه حتى يجف بشكل طبيعي، ثم اشطفيه مع الماء الفاتر،  إستخدمي هذا القناع مرة واحدة في الأسبوع",
    ),
    Recipe(
      id: 'm228',
      category: 'Face',
      title: 'النيم',
      subtitle: 'تنظيف البشرة',
      steps:
          "استخدم عصير النيم في الهند لعلاج مشاكل الوجه منذ العصور القديمة، النصوص الهندوسية القديمة تزخر بقصص الغناء الثناء من شجرة النيم، أوراق النيم هي مضادة للبكتيريا وتساعد على التخلص من احمرار البشره، اهرسي بضعة أوراق النيم وأضيفي القليل من الماء لتشكيل عجينة و ضعيها على البثور أو علامات حب الشباب، واتركيه لمدة 10 دقائق وغسلية بالماء، النيم جيد للبشرة الحساسة أيضا",
    ),
    Recipe(
      id: 'm229',
      category: 'Face',
      title: 'الورد والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "تأخذ حفنة من بتلات الورد مع إضافة كوب من السكر وملعقة كبيرة من زيت الجوجوبا. خلط المكونات جيدا وتوضع على الوجه ويشطف جيدا. هذا الخليط يترك بشرتك رطبة",
    ),
    Recipe(
      id: 'm230',
      category: 'Face',
      title: 'اليقطين',
      subtitle: 'تبييض الوجه',
      steps:
          "كل ما عليك القيام به هو خلط القليل من هريس اليقطين وإضافة إليه ملعقة صغيرة من الحليب مع صفار بيضة. قومي بتطبيق هذا القناع على الوجه وتركه لمدة نصف ساعة أو حتى يجف. بعد ذلك يمكنك تنظيفه بكرة مبللة من القطن. هذه الوصفة تساعد على تبييض الوجه توضيف إليه النضارة الفورية",
    ),
    Recipe(
      id: 'm231',
      category: 'Face',
      title: 'بياض البيض',
      subtitle: 'تنظيف البشرة',
      steps:
          "بياض البيض  يساعد على التخلص من علامات حب الشباب بسهولة وبشكل طبيعي، اخلطي القليل من الطحين مع بياض بيضتين وأضيفي بضع قطرات من عصير الليمون إليه،وعند الحصول على عجينه قومي بوضعها على وجهك والرقبة لمدة 20 دقائق ثم اغسليها بالماء. هذا سيساعدك في التخلص من تفاوت لون البشرة وتخفيف البقع على وجهك، إستخدمي هذا القناع مرة واحدة في الأسبوع لأفضل النتائج",
    ),
    Recipe(
      id: 'm232',
      category: 'Face',
      title: 'جوز الهند والسكر وعصير الخيار',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "خلط نصف كوب من السكر الخشن وسكر أبيض ناعم مع ملعقتين شاي من زيت جوز الهند وملعقة صغيرة من عصير الخيار.يحتوي السكر على حمض الجليكوليك الذي يساعد في التنظيف العميق للبشرة. زيت جوز الهند يرطب الجلد، والخيار يعطي تأثير التنغيم. الاستخدام المنتظم لهذا الخليط يجعل البشرة تبدو أصغر سنا وأكثر ليونة",
    ),
    Recipe(
      id: 'm233',
      category: 'Face',
      title: 'دقيق الشوفان والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "مزج  كوب من السكر مع كوبين من دقيق الشوفان وإضافة بعض زيت اللوز لتشكيل عجينة. تطبيق الخليط على البشرة وفرك بلطف",
    ),
    Recipe(
      id: 'm234',
      category: 'Face',
      title: 'زيت الزيتون',
      subtitle: 'البشرة الدهنية',
      steps:
          "أولا، أغسلي وجهك بدون استخدام الصابون ثم ضعي بضع قطرات من زيت الزيتون على راحة يدك ودلكي وجهك بلطف واتركيه لمدة خمس دقائق، ثم قومي بإزلته بمنشفة رطبة دافئة ولاحظي الفرق على الفور",
    ),
    Recipe(
      id: 'm235',
      category: 'Face',
      title: 'زيت اللوز',
      subtitle: 'تبييض الوجه',
      steps:
          "دلكي وجهك بزيت اللوز الدافئ لزيادة الدورة الدموية وإعطاء بريق لبشرتك. يمكنكِ أيضا نقع اللوز في الماء طوال الليل وطحنه في الصباح اليوم التالي، واخلطيه مع زبدة الحليب وضعيه على وجهك لمدة 15 دقيقة، من ثم اغسليه بالماء البارد عن طريق فرك بحركات دائرية",
    ),
    Recipe(
      id: 'm236',
      category: 'Face',
      title: 'زيت جوز الهند',
      subtitle: 'تنظيف البشرة',
      steps:
          "زيت جوز الهند غني بالمواد المضادة للاكسدة التي تمنع نشاط الجذور، أيضا مضاد للجراثيم ومضاد للفطريات مما تساعد في الحفاظ على البشره، بالإضافة إلى ذلك، يبقي بشرتك ناعمة ورطبة، هذا النفط يمكن ان يخترق عمق الأنسجة بسهولة، ضعي بعض قطرات من زيت جوز الهند في الميكروويف، ثم طبقي الزيت على وجهك والرقبة واليدين والساقين، قومي بتدليكهم بلطف لمدة 10 دقائق، واشطفي الزيت بالماء الفاتر، إستخدمي هذا العلاج مرة واحدة يوميا",
    ),
    Recipe(
      id: 'm238',
      category: 'Face',
      title: 'زيت شجرة الشاي',
      subtitle: 'تنظيف البشرة',
      steps:
          "يساعد زيت شجرة الشاي على التخلص من الشوائب والبقع الداكنة وتفاوت لون البشرة، ويستخدم هذا الزيت العطري على نطاق واسع في علاج البشره،  زيت شجرة الشاي هو متاح بسهولة ويمكنك تطبيق الزيت باستخدام القطن على المنطقة المصابة مباشرة وتترك لتجف",
    ),
    Recipe(
      id: 'm239',
      category: 'Face',
      title: 'شرائح البطاطس',
      subtitle: 'تنظيف البشرة',
      steps:
          "البطاطا  منتج طبيعي يساعد على التخلص من البقع الداكنة، البطاطا تحتوي على إنزيمات خاصة التي تساعد في تبييض البشرة طبيعيا، ويمكن أن تعمل بسهولة على البقع الداكنة، وكذلك تضيء البشرة، قومي بتقطيع البطاطا إلى شرائح مستديرة، وخذي شريحة وطبقيها على وجهك مباشرة. وافركيها لمدة 5 دقائق، ثم اغسليها بالماء، ويمكن استخدام هذه الطريقة في أي وقت وستلاحظين الفرق",
    ),
    Recipe(
      id: 'm240',
      category: 'Face',
      title: 'صفار البيض',
      subtitle: 'البشرة الدهنية',
      steps:
          "صفار البيض هوعلاج بسيط وسريع في التخلص من البشرة الدهنية. طبيقي صفار بيضتين على وجهك باستخدام قطنة، واتركيه لمدة 15 دقيقة حتى يجف تماما، ثم اغسليه بالماء البارد",
    ),
    Recipe(
      id: 'm241',
      category: 'Face',
      title: 'صودا الخبز',
      subtitle: 'تنظيف البشرة',
      steps:
          "خصائصه المطهرة والمضادة للالتهابات خفيفة تساعد في حل مشاكل حب الشباب، والبثور والبقع، كما أنها ممتازة لتقشير والحفاظ على البشرة خالية من الأوساخ والشوائب وخلايا الجلد الميتة، امزجي مقدار ملعقة من صودا الخبز مع ملعقة صغيرة من عصير الليمون أو الماء للحصول على عجينة، أولا قومي بطهير وجهك ثم طبقي الخليط على البشرة لتقشير الجلد بلطف،  أخيرااشطفي وجهك بالماء الفاتر وجفيفية بالمنشفه، اتبعي هذا العلاج مرتين أو ثلاث مرات في الأسبوع.  بدلا من ذلك، امزجي ملعقة من صودا الخبز والعسل، ثم طبقي الخليط على البشرة بشرتك ودلكيه برفق لمدة دقيقة واحدة، واغسليه بالماء الفاتر ثم اغسليه بالماء البارد لإغلاق المسام. اتبعي هذا العلاج مرة واحدة في الأسبوع",
    ),
    Recipe(
      id: 'm242',
      category: 'Face',
      title: 'صودا الخبز',
      subtitle: 'البشرة الدهنية',
      steps:
          "صودا الخبز رائع للبشرة فهو يساعد في تقشير وإزالة خلايا الجلد الميتة ويسيطرعلى الدهون. امزجي ملعقتين من صودا الخبز مع ملعقة كبيرة من الماء وطبّقيها على وجهك لمدة 5 دقائق حتى تجف، ثم تغسل بالماء الدافئ",
    ),
    Recipe(
      id: 'm243',
      category: 'Face',
      title: 'طحين الأرز والعسل',
      subtitle: ' تبييض الوجه',
      steps:
          "اخلطي نصف ملعقة من العسل مع كوب من الماء والشاي وملعقتين من دقيق الأرز. بعد ذلك، ضعي الخليط على وجهك ودلكيه بلطف، وأتركيه لمدة 15 إلى 20 دقيقة بعدها قومي بغسله عن طريق حركات دائرية لتساعد على ازالة خلايا الجلد الميتة",
    ),
    Recipe(
      id: 'm244',
      category: 'Face',
      title: 'طحين الحمص',
      subtitle: 'تبييض الوجه',
      steps:
          "طحين الحمص هو طريقة رائعة للغاية لتفتيح البشرة في المنزل أيضا يحافظ على محتوى العناصر الغذائية الصحية على البشرة. كما أنه يزيل الزيوت الزائدة ويجعلها تحتفظ بالرطوبة. قومي بصنع عجينة سميكة وذلك بخلط القليل من الطحين الحمص مع بعض الماء أو ماء الورد. ضعي هذه العجينة على وجهك والرقبة وتركها حتى تجف. بعد ذلك يمكنك الشطف بالماء البارد",
    ),
    Recipe(
      id: 'm245',
      category: 'Face',
      title: 'عبق اللافندر والسكر',
      subtitle: 'تقشير وتنظيف الوجه',
      steps:
          "كوبين من السكر يخلط مع كوب من زيت اللوز. إضافة بضعة قطرات من زيت اللافندر. فرك الخليط لإعطاء انتعاش وناعمة ونضرة للبشرة",
    ),
    Recipe(
      id: 'm246',
      category: 'Face',
      title: 'عصير الليمون',
      subtitle: 'تنظيف البشرة',
      steps: ''' C الليمون غني بحمض الستريك وفيتامين
      والذي يعمل على تجديد خلايا البشرة.  قومي بتقطيع ليمونة الى نصفين،  خوذي نصف ليمونة وافركيها بحركة دائرية مباشرة على المنطقة المصابة، واتركيها لمدة 5 دقائق قبل غسل الوجه،  ستلاحظين إختفاء البقع الداكنة
      بدلا من ذلك، طبيقي عصير الليمون الطازج وضعيه على الوجه والعنق، واتركيه لمدة 10 دقائق ثم غسله بالماء الفاتر، ثم افركي شرائح الخيار لتليين وترطيب البشرة، كرّري العلاج يوميا أو كل يومين. وثمة خيار آخر، إستخدمي عصير نصف ليمونة واخلطيها مع 1-2 ملاعق كبيرة من العسل، طبيقي هذا الخليط على وجهك، واتركيه لمدة 15 إلى 20 دقيقة ثم اشطفيه''',
    ),
    Recipe(
      id: 'm247',
      category: 'Face',
      title: 'عصير الليمون',
      subtitle: 'البشرة الدهنية',
      steps:
          "الليمون لا يستخدم فقط لعلاج البشرة الدهنية فهو رائع أيضا في أحياء وتجديد خلايا الجلد. امزجي كمية متساوية من الماء وعصير الليمون وطبّقيها على وجهك واتركيه لبضع دقائق حتى تجف. بعد ذلك، قومي بشطفه بالماء الدافئ ثم يليه الماء البارد. هذا العلاج منعش للبشرة ويزيل فائض الزيت",
    ),
    Recipe(
      id: 'm248',
      category: 'Face',
      title: 'عصير الليمون ومسحوق الحليب',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي مسحوق الحليب مع العسل وعصير الليمون لتصبح على شكل العجينة. طبّقيها على وجهك لمدة 20 دقيقة من ثم اغسليه بالماء الدافئ. هذه الخلطة ممتازة لعلاج حروق الشمس والبقع الداكنة",
    ),
    Recipe(
      id: 'm249',
      category: 'Face',
      title: 'فتات الخبز',
      subtitle: 'تبييض الوجه',
      steps:
          "ضعي حفنة من فتات الخبز في وعاء واضيفي إليه كريم الحليب واتركيه لمدة دقيقتين. طبيقي المزيج على وجهك ورقبتك لمدة 15 دقيقة. بعدها اغسليه وسترين توهج وبياض غير العادي",
    ),
    Recipe(
      id: 'm250',
      category: 'Face',
      title: 'قشر البرتقال',
      subtitle: 'البشرة الدهنية',
      steps:
          "جففي قشر البرتقال في الشمس ثم اطحنيه، امزجي كمية كافية من ماء الورد ومسحوق قشر البرتقال وضعيه على وجهك لمدة 15 دقيقة حتى يجف، ثم اشطفيه بالماء. اتبعي الطريقة بانتظام لعلاج البشرة الدهنية والرؤوس السوداء",
    ),
    Recipe(
      id: 'm251',
      category: 'Face',
      title: 'قشر البرتقال',
      subtitle: 'تبييض الوجه',
      steps:
          "جففي قشور البرتقال وقومي بطحنها واضيفي إليها القليل من الزبادي لتشكيل عجينة. طبّقيها على وجهك لمدة 15 دقيقة وتجنبي منطقة العين، من ثم اغسليه بالماء البارد وسترين نتائج إيجابية في وقت قصير",
    ),
    Recipe(
      id: 'm252',
      category: 'Face',
      title: 'قشور البرتقال وخشب الصندل',
      subtitle: 'تبييض الوجه',
      steps:
          "أخلطي ملعقة واحدة من مسحوق خشب الصندل ومسحوق قشور البرتقال واضيفي إليها القليل من الماء. قومي بتدليك الخليط على وجهك لمدة 5 دقائق من ثم اغسليه بعد تركه لحوالي 15 دقيقة. يساعد هذا الخليط في تقشير البشرة وازالة البقع الداكنة",
    ),
    Recipe(
      id: 'm252',
      category: 'Face',
      title: 'قناع الجزر والأفوكادو',
      subtitle: 'تبييض الوجه',
      steps:
          "اهرسي ثمرة الأفوكادو والجزر المطبوخ واضيفي إليها نصف كوب من القشدة الثقيلة وبيضة والقليل من العسل. إدهني الخليط على جهك ورقبتك واتركيه لمدة 15 دقيقة، من ثم اغسليه بالماء البارد",
    ),
    Recipe(
      id: 'm253',
      category: 'Face',
      title: 'قناع الخيار',
      subtitle: 'تبييض الوجه',
      steps:
          "امزجي ملعقة من عصير الخيار مع ملعقة من عصير الليمون. ضعي المزيج على وجهك واشطفيه بعد مرور  15 دقيقة",
    ),
    Recipe(
      id: 'm254',
      category: 'Face',
      title: 'قناع اللوز والعسل',
      subtitle: 'البشرة الدهنية',
      steps:
          "أخلطي كمية كافية من اللوز المطحون والعسل لتشكيل عجينة. ثم دلكي الخليط بلطف على وجهك بقطعة قماش دافئة ورطبة لمدة 5 - 10 دقائق. بعد ذلك، اشطفيه بالماء وكرّري الخلطة باستمرار حتى تتخلصي من البشرة الدهنية",
    ),
    Recipe(
      id: 'm255',
      category: 'Face',
      title: 'ماء جوز الهند',
      subtitle: 'تبييض الوجه',
      steps:
          "لا يمكن التفكير في المشروبات أفضل من ماء جوز الهند والذي يحافظ على جسم بارد داخليا. كما أثبت أنه مفيد في تبييض البشرة. كل ما عليك القيام به هو فرك البشرة بكرة من القطن مغموسة في ماء جوز الهند. ماء جوز الهند خفيف جدا على البشرة، لذلك ليس هناك الحاجة لغسل الوجه. أيضا شرب ماء جوز الهند غني بالمعادن الأساسية",
    ),
    Recipe(
      id: 'm256',
      category: 'Face',
      title: 'مسحوق الشوفان والعسل',
      subtitle: 'تبييض الوجه',
      steps:
          "امزجي قطرتين من زيت اللوز مع ملعقتين كبير كل من مسحوق الشوفان والعسل. الآن، طبيقي المزيج على كامل وجهك واتركيه لمدة 10 - 15 دقيقة، من ثم اغسليه بالماء الدافئ. هذه الخلطة رائعة لتبيض الوجه",
    ),
    Recipe(
      id: 'm257',
      category: 'Face',
      title: 'مسحوق خشب الصندل',
      subtitle: 'تبييض الوجه',
      steps:
          "هل لديك بشرة دهنية؟ هذا القناع معمول خصيصا لك. أعدّي عجينة من مسحوق خشب الصندل والماء وطبّقيها على وجهك حتى تجف. بعد ذلك، إغسلي وجهك بالماء البارد وسترين نتائج فورية",
    ),
    Recipe(
      id: 'm258',
      category: 'Face',
      title: 'نشا الذرة',
      subtitle: 'البشرة الدهنية',
      steps:
          "امزجي ثلاث ملاعق كبيرة من نشا الذرة مع القليل من الماء الدافئ. طبيقي الخليط على وجهك وافركيه جيدا واتركيه لبضع دقائق حتى يجف، ثم يشطف بالماء الفاتر. كرّري العلاج مرة على الأقل يوميا لتتخلصي من البشرة الدهنية",
    ),
    Recipe(
      id: 'm259',
      category: 'Weight',
      title: 'خلطة الحلبة والعسل',
      subtitle: 'زيادة الوزن',
      steps:
          'فهي من الأكثر الوصفات الطبيعية التي تساعدك على زيادة وزنك بالإضافة إلى أنّها حلوة المذاق ومفيدة للجسم. ويمكنك إعدادها في المنزل وذلك بإحضار الحلبة وغليها في الماء وثم تصفيتها وبعد ذلك نقوم بتحليتها بالعسل، وينصح بشربها ثلاث مرات يومياً حتى يزيد وزنك',
    ),
    Recipe(
      id: 'm260',
      category: 'Weight',
      title: 'التمر',
      subtitle: 'زيادة الوزن',
      steps:
          "التمرمع الحليب وياخذ كوب بعد كل وجبه\n التمر مع البطيخ بعد كل وجبه\n الخيار مع البطيخ من اهم ما يساعد على زياده الوزن بسرعه فذكر عن السيده عائشه رضى الله عنها انها قالت ثمنتنى امى بكل شىء فلم اثمن فااطعمتنى التمر والخيار فثمنت\n العنبر الازرق مع اللبن ويشرب بعد كل وجبه يرفع الوزن بسرعه والعنبر كانوا يستخدموه البدو من فتره ماضيه كبيرة ليثمنوا لان كان الوزن الزائد للمراه فى هذا الوقت كان من اهم عوامل الجمال\n اللوز +العجوه+عسل نحل بعد الاكل ينقع اللوز فى ماء قبلها بليله ثم يوضع على التمر والعسل وسوف تلاحظين الفرق بمرور شهر على استخدام هذه الطريقة",
    ),
    Recipe(
      id: 'm261',
      category: 'Weight',
      title: 'الحلبة ',
      subtitle: 'زيادة الوزن',
      steps:
          "يغلى كأس من الماء ثم يضاف إليه ما مقداره 3جرامات من مسحوق الحلبة ويترك يغلي لمدة دقيقة واحدة ثم يصفى ويحلى بالعسل ويشرب بمعدل ثلاث مرات في اليوم ويستمر الشخص في الاستعمال حتى يحصل على الوزن المطلوب. كما يفيد أكل الحلبة الخضراء كثيراً في زيادة الوزن",
    ),
    Recipe(
      id: 'm262',
      category: 'Weight',
      title: 'الحلبة ',
      subtitle: 'زيادة الوزن',
      steps:
          "نص كوب ماء + ملعقة ونص زيت الحلبة من العطار ويشرب على الريق وقبل النوم وتأخذ معه ملعقة من المربى",
    ),
    Recipe(
      id: 'm263',
      category: 'Weight',
      title: 'الحلبة ',
      subtitle: 'زيادة الوزن',
      steps:
          "أغلي القليل من الحلبة والعسل والسكر + ماء.. ولكي تتخلص من رائحة الحلبة من جسمك قوم بتحميصها قبل الاستخدام .. وابضا عن الحلبة اضافة ملعقة صغيرة من مسحوق الحلبة الى لتر من الماء وغليه لمدة دقيقة واحدة فقط يصفى بعدها المغلي ويشرب بجرعات متعددة ( ملعقة كبيرة كل ساعة )اما اذا حبيتي ان تستخدمي مسحوق بذور الحلبة فانه يمزج منه مقدار 10 جرامات مع كمية معادلة من زيت الزيتون ويؤخذ ربع هذه الكمية اربع مرات في اليوم واول ما تشوفي جسمك اعتدل توقفي عن استخدامه زيت حلبة + زيت خروع:بمقادير متساوية ويدهن على المكان المراد",
    ),
    Recipe(
      id: 'm264',
      category: 'Weight',
      title: 'الكزبرة',
      subtitle: 'زيادة الوزن',
      steps:
          "نظراً لأن الكزبرة تحتوي على الحديد والتي تؤدي بدورها إلي زيادة عدد كريات الدم الحمراء في الجسم النحيف وكذلك يحسن هيموجلوبين الدم ويجب أن يتناول الشخص بذور الكزبرة على هيئة مسحوق حيث يؤخذ ملء ملعقة كبيرة من المسحوق ويسف بعد كل وجبة غذائية أو يمكن وضع هذه الكمية مع السلطة وأكلها جميعاً والمدة الزمنية لاستخدام الكزبرة شهر كامل",
    ),
    Recipe(
      id: 'm265',
      category: 'Weight',
      title: 'حب العزيز',
      subtitle: 'زيادة الوزن',
      steps:
          "يطحن ويضاف إليه حلبه ومكسرات مثل اللوز والفستق ويؤخذ مع كأس حليب أربع مرات في اليوم شهر كامل أوأقل شوي (نطحنه مع اللوز والفستق ونخلطه بالحليب ونشربة لوز + جوز + تمر + عسل)يعجن ويعمل على شكل كور ويؤكل منه 3حبات يومياً تخلطي ملعقتين من الحلوه الطحينيه مع علبه صغيره لبن زبادي وتاكليه على الريق",
    ),
    Recipe(
      id: 'm266',
      category: 'Weight',
      title: 'أوراق الجوز',
      subtitle: 'زيادة الوزن',
      steps:
          "ملعقة متوسطة من أوراق الجوز في كوب ماء حار مدة ربع ساعة ثم يُصفى ويشرب كوب بعد الغداء بساعتين وكوب بعد العشاء بساعتين لتسمين الوجه اكل الكيوي",
    ),
    Recipe(
      id: 'm267',
      category: 'Weight',
      title: 'خلطة الحلبة والعسل',
      subtitle: 'زيادة الوزن',
      steps:
          "فهي من الأكثر الوصفات الطبيعية التي تساعدك على زيادة وزنك بالإضافة إلى أنّها حلوة المذاق ومفيدة للجسم. ويمكنك إعدادها في المنزل وذلك بإحضار الحلبة وغليها في الماء وثم تصفيتها وبعد ذلك نقوم بتحليتها بالعسل، وينصح بشربها ثلاث مرات يومياً حتى يزيد وزنك",
    ),
    Recipe(
      id: 'm268',
      category: 'Weight',
      title: 'الحلبة',
      subtitle: 'زيادة الوزن',
      steps:
          "تعد الحلبة هي الخيار الأول لمن يرد زيادة الوزن، وهناك عدة وصفات تستخدم فيها الحلبة كعنصر رئيسي، جميعها تؤدي لنفس الغرض، بمكونات مختلفة. أسهل وصفة باستخدام الحلبة هي إضافة بودرة الحلبة إلى كوب ماء مغلي، نترك الماء لمدة تقرب ال60 ثانية ثم نقوم بإزالة البودة باستخدام المصفاة",
    ),
    Recipe(
      id: 'm269',
      category: 'Weight',
      title: 'وصفة الزبيب والسمسم',
      subtitle: 'زيادة الوزن',
      steps:
          "وهذه وصفة جيدة وتساعدك كثيراً على زيادة وزنك، وننصحك بتناول 160 غم من الزبيب يومياً، وتناول ملعقتان من السمسم لمرتين أو ثلاث مرات في اليوم وأيضاً يفضل تناول الموز يومياً وسوف تلاحظ زيادة وزنك بطريقة سريعة وسهلة",
    ),
    Recipe(
      id: 'm270',
      category: 'Weight',
      title: 'وصفة المكسرات',
      subtitle: 'زيادة الوزن',
      steps:
          "ننصحك بتناول اللوز والفستق والبندق يومياً مع كأس من الحليب أو طحنها وإضافتها مع الحليب، فهي مفيدة لجسمك وأيضاً تزيد وزنك كونها تحتوي على البروتينات",
    ),
    Recipe(
      id: 'm271',
      category: 'Weight',
      title: 'وصفة اللوز والعسل',
      subtitle: 'زيادة الوزن',
      steps:
          "أيضاً المكسرات عند خلطها مع العسل تعطيك نتيجة رائعة ويمكنك الحصول عليها بالقيام بإحضار اللوز والعسل والجوز والتمر وخلطهم مع بعضهم البعض على شكل كرات وتناول ثلاث كرات يومياً حتى تلاحظ زيادة وزنك",
    ),
    Recipe(
      id: 'm272',
      category: 'Weight',
      title: 'عسل النحل',
      subtitle: 'زيادة الوزن',
      steps:
          "استخدم عسل النحل لتحلية ماء الحلبة، يضاف حسب الرغبة، ويتم أخذ الجرعة ذاتها 3 مرات موزعة على مدار اليوم، إلى أن يصل للوزن المطلوب",
    ),
    Recipe(
      id: 'm273',
      category: 'Weight',
      title: 'الحلبة',
      subtitle: 'زيادة الوزن',
      steps:
          "وصفة حديثة تتخذ من الحلبة مادتها الأساسية، وهي كالآتي: عليك بتحضير ما مقداره لتر من الماء المغلي أو أكثر قليلاً، ثم اضف ملعقة شاء كبيرة ونصف من زيت الحلبة، اترك المزيج حتى يبرد قليلأ، تناوله على مرتين خلال اليوم، عند الإستيقاظ من النوم صباحاً، وقبيل الخلود إلى النوم، قد يلجأ البعض لبعض المحليات كالعسل أو الشوكولاتة أو المربى",
    ),
    Recipe(
      id: 'm274',
      category: 'Weight',
      title: 'الكزبرة',
      subtitle: 'زيادة الوزن',
      steps:
          "استخدام الكزبرة في زيادة الوزن، السبب الأساسي في استخدام الكزبرة في زيادة الوزن أنها تقوم بزيادة معدل خلايا الدم الحمراء في الدم، ويمكن تناولها إما عن طريق بلعها مباشرة دون إضافات أو تغيير على شكل البذور أو إضافتها لسلطة ما وتناولها. يجب أن يستمر تناول الكزبرة لمدة ثلاثين يوما بالتمام والكمال. يمكن استخدام عسل النحل لوحده على ثلاث مرات يومياً، في كل مرة يتم تناول ملعقة صغيرة.",
    ),
    Recipe(
      id: 'm275',
      category: 'Weight',
      title: 'التمر والزبيب والجوز',
      subtitle: 'زيادة الوزن',
      steps:
          "أما التمر والزبيب والجوز فيمكن إعداد خليط منهم وتناول حفنة على مدى أربعة أسابيع، أربعة مرات يومياً. أما بالنسبة لطرق زيادة الوزن الغير طبيعية",
    ),
    Recipe(
      id: 'm276',
      category: 'Weight',
      title: 'خميرة العجين',
      subtitle: 'زيادة الوزن',
      steps:
          "أوقية من خميرة العجين، ونضيف إليها ملعقة من ملح الطعام، وثلاث ملاعق من السكر، وكوب من السمن البلدي، ويتم خلط المكوّنات لصنع نسيج متجانس متناسق، ويتم استخدامها على الساقين والأرداف لمدةّ ساعتين بدهنها، ويتم استخدام الطريقة أكثر من مرّة في اليوم لتظهر النتيجة بشكل أسرع",
    ),
    Recipe(
      id: 'm277',
      category: 'Weight',
      title: 'الحلبة والخميرة',
      subtitle: 'زيادة الوزن',
      steps:
          "تعتبر طريقة سهلة وميسّرة إذ إنّ مكوّناتها متوفّرة في المنزل إذ يتم غلي الحلبة وطحن حبيبتها، وإضافتها للخميرة وخلطهما معاً ويتمّ دهن الساقين والأرداف ويظل الخليط على الجسم لمدّة خمس ساعات، ويتمّ تكرار الطريقة لتظهر النتيجة، ويفضل استخدام الوصفة ليلاً حتى تأخذ وقتها وفي الصباح يتم الاستحمام بالماء الدافئ",
    ),
    Recipe(
      id: 'm278',
      category: 'Weight',
      title: 'خليط الزيوت',
      subtitle: 'زيادة الوزن',
      steps:
          "وصفة خليط من الزيوت التي تعدّ نتيجتها فعالة جداً مقارنة بغيرها من الطرق، ومجربة كثيراً، وتحضّر عن طريق خلط زيت حبة البركة، وزيت إكليل الجبل، وزيت الحلبة، ويتم خلط المكوّنات جيداً ووضعهم في إناء محكم ويتم دهن الساقين والأرداف بها وتترك فترة ست ساعات والنتائج مذهلة إن شاء الله",
    ),
    Recipe(
      id: 'm279',
      category: 'Weight',
      title: 'الخميرة بالحليب والعسل',
      subtitle: 'زيادة الوزن',
      steps:
          "تحضّر الخلطة عن طريق خلط الخميرة بالحليب والعسل ومسحوق البيكنج بودر يتم خلط المواد الجافة أولا ويضاف إليها العسل للحصول على النسيج المنتظم والمتجانس، ويتم دهن منطقة الساقين والأرداف لمدة ثلاث ساعات ويتم الاستحمام بالماء الدافئ",
    ),
    Recipe(
      id: 'm280',
      category: 'Weight',
      title: 'اللبن البقري',
      subtitle: 'زيادة الوزن',
      steps:
          "تحضّر هذه الخلطة عن طريق مزج كوب من اللبن البقري، مع كوب من السمن البلدي، مع ثلاث ملاعق من السكر، مع ملعقة صغيرة من الملح، ويتم خلط المكونات خلطاً جيداً لنحصل على عجينة متجانسة، ويتم دهن منطقة الساقين والأرداف ويظل الدهان لمدة ساعتين وبعدها الاستحمام بالماء الدافئ",
    ),
    Recipe(
      id: 'm281',
      category: 'Weight',
      title: 'البطاطا المهروسة',
      subtitle: 'زيادة الوزن',
      steps:
          "تعتبر البطاطا من الكربوهيدرات التي تحتوي على سعرات حرارية عالية وغنية بالفيتامينات مثل فيتامين سي وتحتوي على المعادن مثل البوتاسيوم وتعطي الجسم الألياف الغذائية التي تفيد الجهاز الهضمي، ومن الأفضل تناول البطاطا مشوية أو مسلوقة للاستفادة منها",
    ),
    Recipe(
      id: 'm282',
      category: 'Weight',
      title: 'خلطة الحلبة والزعتر',
      subtitle: 'زيادة الوزن',
      steps:
          "يتم خلط مسحوق الحلبة مع الزعتر الجاف ونضيف عليه بضع حبات من الزبيب ونقلبهم جيدًا مع العسل الأبيض ونضعهم في البرطمان ونضعها في الثلاجة وتناول ملعقتين كل يوم على الريق",
    ),
    Recipe(
      id: 'm283',
      category: 'Weight',
      title: 'خلطة السمنة مع السكر',
      subtitle: 'زيادة الوزن',
      steps:
          "وهي عبارة عن وضع 2 ملعقة صغيرة من السمن مع 2 ملعقة صغيرة من السكر ونضربهم مع بعض جيدًا ويتكون خليط كريمي ويتم تناول هذه الوصفة قبل الأكل ب 30 دقيقة لمدة أسبوعين ويظهر فرق ملحوظ في الوزن",
    ),
    Recipe(
      id: 'm284',
      category: 'Weight',
      title: 'العرقسوس',
      subtitle: 'زيادة الوزن',
      steps:
          "يعتبر العرقسوس من الأعشاب التي تساعد على زيادة الوزن ويتم استخدامه بطريقة سهلة حيث يتم نقع أعشاب العرقسوس لمدة 50 إلى 60 دقيقة ثم تصفيته وتناول كوب ثلاث مرات في اليوم قبل تناول كل وجبة وسيعطي فرق ملحوظ في الوزن بعد عدة أيام من تناوله",
    ),
    Recipe(
      id: 'm285',
      category: 'Weight',
      title: 'جذور الجنطيانا',
      subtitle: 'زيادة الوزن',
      steps:
          "تعتبر جذور الجنطيانا من الأعشاب حيث يتم غلي هذه الجذور لمدة 20 إلى 30 دقيقة ثم تركها حتى تبرد ثم تناول كوب من هذه البذور ومن الممكن تحليته بملعقتي من العسل الأبيض وتناولها مرتين في اليوم مرة في الصباح قبل الإفطار على الريق ومره قبل النوم",
    ),
    Recipe(
      id: 'm286',
      category: 'Weight',
      title: 'عشبة الهندباء',
      subtitle: 'زيادة الوزن',
      steps:
          "تتميز عشبة الهندباء أنها مفيدة للجسم وتساعد الجسم على التخلص من السموم قدره كما أنها تنقي الكبد والكلى، يتم غلي عشبة الهندباء على النار لمدة خمس دقائق ثم تركها حتى تبرد وتحليتها بملعقة من العسل الأبيض وتناولها",
    ),
    Recipe(
      id: 'm287',
      category: 'Weight',
      title: 'خلطة الخميرة والسكر',
      subtitle: 'زيادة الوزن',
      steps:
          "تعرف الخميرة بأنها تحتوي على أكثر من 12 فيتامين يساعد على تخلص الجسم من البكتيريا الضارة وزيادة وزن الجسم ويتم استخدام الخميرة مرتين أو ثلاث مرات في اليوم بأخذ قطعه صغيره من الخميرة في كوب نصف كوب ماء ونصف ملعقة سكر واذابتها جيدًا ثم تناولها",
    ),
    Recipe(
      id: 'm288',
      category: 'Weight',
      title: 'خلطة الخميرة',
      subtitle: 'زيادة الوزن',
      steps:
          "والحليب وهي تساعد على زيادة الجسم بسرعة فائقة وذلك بوضع نصف ملعقة صغيرة من الخميرة إلى كوب من اللبن الدافئ ومن الممكن تحليته بملعقتي طعام من العسل الأبيض وتناوله على الريق",
    ),
    Recipe(
      id: 'm289',
      category: 'Weight',
      title: 'خلطة العسل الاسود والحالة',
      subtitle: 'زيادة الوزن',
      steps:
          "في إناء نضع مقدار كيلو من العسل مع حلبة ويتم غليهم على النار ونضيف ملعقة كبيرة من زيت الزيتون، ونتركه على النار لمدة 15 دقيقة أو أكثر، نترك الخلطة حتى تبرد ثم نضعها في برطمان في الثلاجة وتناولها أكثر من مرة في اليوم ومن الممكن تناوله بالخبز الابيض او الخبز البلدي",
    ),
    Recipe(
      id: 'm290',
      category: 'Weight',
      title: 'عجة البيض',
      subtitle: 'زيادة الوزن',
      steps:
          "تعتبر عجة البيض من الوصفات الغنية بالبروتين وذات سعرات حرارية عالية والتي تساعد على زيادة الوزن ومفيدة للجسم ويتم تناولها كوجبة خفيفة او على الإفطار وإضافة مكونات غذائية مثل: بطاطا مهروسة، أي نوع من الجبن، خضار مثل البقدونس والزعتر والبصل",
    ),
    Recipe(
      id: 'm291',
      category: 'Weight',
      title: 'الأفوكادو',
      subtitle: 'زيادة الوزن',
      steps:
          "يعتبر الأفوكادو من مصادر البروتين والدهون غير المشبعة المفيدة للجسم والذي يمكن تناوله مع ساندويتش اللحم أو إضافته إلى السلطة",
    ),
    Recipe(
      id: 'm291',
      category: 'Weight',
      title: 'وصفة الزهورات والتمر',
      subtitle: 'زيادة الوزن',
      steps:
          "اخلط ملعقة من أعشاب الزهورات المتوفّرة لديك والتي تتضمّن: البابونج، واليانسون، وبتلات الورد الجوريّ وغيرها من الأعشاب، -مع العلم أنّه بإمكانك شراؤها جاهزةً من محلّات العطارة، مع كأسٍ من العصير أو الحليب، إلى جانب ثلاث حبّات من التمر، واحرصْ على تناول هذه الوجبة إلى جانب وجبتيْ الفطور والعشاء",
    ),
  ];

  UnmodifiableListView<Recipe> get recipies => UnmodifiableListView(_recipies);

  Future<Recipe> randomRecipe() async {
    Random random = new Random();
    int randomNumber = 0;
    SharedPreferences prefs = await SharedPreferences.getInstance();
    String date = prefs.getString('date') ?? "2020-03-26T01:34:20.826589";
    DateTime dateTime = DateTime.parse(date).toLocal();
    int currentDay = DateTime.now().day;

    if (dateTime.day != currentDay) {
      randomNumber = random.nextInt(DataModel().recipies.length);
      prefs.setString('date', DateTime.now().toUtc().toIso8601String());
      prefs.setInt('random', randomNumber);
      print("2");
    } else {
      randomNumber = prefs.getInt('random') ?? 6;
    }
    notifyListeners();
    return _recipies[randomNumber];
  }

  void removeAll() {
    notifyListeners();
  }

  List<Recipe> listOfChoosenRecipies(String category) {
    return _recipies.where((recipe) => recipe.category == category).toList();
  }

  List<Recipe> listOfWeightRecipe() {
    return _recipies.where((recipe) => recipe.category == 'Weight').toList();
  }

  Recipe selectedRecipe(String recipeId) {
    return _recipies.firstWhere((recipe) => recipe.id == recipeId);
  }

  final List<Category> _recipeCategory = const [
    Category(
        category: 'Eyes',
        title: 'العين',
        description: 'وصفات مجربة لعينين جذابتين',
        image: 'lib/assets/images/body_parts/eyes.png'),
    Category(
        category: 'Lips',
        title: 'الشفاه',
        description: 'شفاه تبهي لإبتسامتك رونقا وجمالا',
        image: 'lib/assets/images/body_parts/lips.png'),
    Category(
        category: 'Body',
        title: 'الجسم',
        description: 'لجسم رشيق وصحي وجسد خال من العيوب',
        image: 'lib/assets/images/body_parts/body.png'),
    Category(
        category: 'Hands',
        title: 'اليدين',
        description: 'ليدين جميلتين وذات ملمس ناعم',
        image: 'lib/assets/images/body_parts/hands.png'),
    Category(
        category: 'Teeth',
        title: 'الاسنان',
        description: 'سر الإبتسامة المشرقة هي الأسنان الصحية',
        image: 'lib/assets/images/body_parts/teeth.png'),
    Category(
        category: 'Nails',
        title: 'الاظافر',
        description: 'اظافر طويلة وجميلة',
        image: 'lib/assets/images/body_parts/nails.png'),
    Category(
        category: 'Hair',
        title: 'الشعر',
        description: 'الإعتناء بالشعر وقشرة الرأس',
        image: 'lib/assets/images/body_parts/hair.png'),
    Category(
        category: 'Face',
        title: 'الوجه',
        description: 'اعتني بوجهك فهو علامة لأنوثتك سيدتي',
        image: 'lib/assets/images/body_parts/face.png'),
  ];

  UnmodifiableListView<Category> get categories =>
      UnmodifiableListView(_recipeCategory);

  Category selectedCategory(String categoryId) {
    return _recipeCategory
        .firstWhere((category) => category.category == categoryId);
  }

  void addToFavorite(String itemId) async {
    List<String> _favoriteRecipeList = [];
    SharedPreferences prefs = await SharedPreferences.getInstance();

    bool _seen = (prefs.getBool('favoriteFirst') ?? false);

    if (_seen) {
      _favoriteRecipeList = prefs.getStringList('favorite') ?? [];

      if (!_favoriteRecipeList.contains(itemId)) {
        _favoriteRecipeList.add(itemId);
        prefs.setStringList('favorite', _favoriteRecipeList);
        notifyListeners();
      }
    } else {
      await prefs.setBool('favoriteFirst', true);
      prefs.setStringList('favorite', []);
      _favoriteRecipeList.add(itemId);
      prefs.setStringList('favorite', _favoriteRecipeList);
    }

    notifyListeners();
  }

  Future<List<String>> favoritedItems() async {
    final prefs = await SharedPreferences.getInstance();
    final myList = prefs.getStringList('favorite') ?? [];
    notifyListeners();
    return myList;
  }

  void removeFavorited(String id) async {
    final prefs = await SharedPreferences.getInstance();
    final myList = prefs.getStringList('favorite') ?? [];
    myList.remove(id);
    prefs.setStringList('favorite', myList);
    print("remove $myList");

    notifyListeners();
  }

  void removeAllFavorite() async {
    final prefs = await SharedPreferences.getInstance();
    prefs.setStringList('favorite', []);
    notifyListeners();
  }

  void clearPrefs() async {
    final prefs = await SharedPreferences.getInstance();
    prefs.clear();
    notifyListeners();
  }

  double bmi = 0;

  double calculateBmi(int height, int weight) {
    return bmi = weight / pow(height / 100, 2);
  }

  String bmiNotation(double bmi) {
    if (bmi > 30) {
      return 'سمنة مفرطة!';
    }
    if (bmi > 25) {
      return 'سمنة';
    } else if (bmi > 18.5) {
      return 'وزن طبيعي';
    } else if (bmi > 16) {
      return 'نحافة';
    } else
      return 'نحافة مفرطة';
  }

  String bmiAdvice(double bmi) {
    if (bmi > 30) {
      return 'أنت تعانين من السمنة المفرطة، احذري! فوصولك لهذه الدرجة قد يجعلك معرضة للعديد من المشاكل الصحية';
    }
    if (bmi > 25) {
      return 'يبدو لنه لديك سمنة ينصح بممارسة التمارين الرياضية والإبتعاد قدر المستطاع عن الأكل الغني بالدهون والسعرات الحرارية';
    } else if (bmi > 18.5) {
      return 'ان وزنك طبيعي، حاولي المحافظة عليه بالنوم المنتظم والأكل الصحي بإستهلاك كفايتك من السعرات الحرارية مع ممارسة التمارين الرياضية';
    } else if (bmi > 16) {
      return 'يمكنك زيادة وزنك  بزيادة السعرات الحرارية عنطريق الأكل الصحي المتوازن وممارسة التمارين الرياضية';
    } else
      return 'يبدو انك تعانين من نحافة مفرطة والتي قد تؤدي الا مشاكل صحية تحتاجين الى التغذية الصحية لزيادة وزنك';
  }

  void showSnakBare(bool addORremove, BuildContext context) {
    if (addORremove) {
      final snackBar = SnackBar(
        backgroundColor: Colors.green[200],
        content: Text(
          'تمت الإضافة للمفضلة',
          textAlign: TextAlign.center,
        ),
        duration: Duration(milliseconds: 500),
      );
      ScaffoldMessenger.of(context)
        ..hideCurrentSnackBar()
        ..showSnackBar(snackBar);
    } else {
      final snackBar = SnackBar(
        backgroundColor: Colors.red[200],
        content: Text(
          'تمت الإزالة من المفضلة',
          textAlign: TextAlign.center,
        ),
        duration: Duration(milliseconds: 500),
      );
      ScaffoldMessenger.of(context)
        ..hideCurrentSnackBar()
        ..showSnackBar(snackBar);
    }
  }
}
